Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: All flags have been removed. To undo, uncheck the box.
cy: Mae pob fflag wedi cael ei dileu. I ddad-wneud, dadwiriwch y blwch.

source: You have already reported this annotation.
cy: Rydych eisoes wedi adrodd am yr anodiad hwn.

source: Report annotation as inappropriate or offensive.
cy: Adrodd am yr anodiad am fod yn amhriodol neu'n sarhaus.

source: An unexpected error occurred. Please try again.
cy: Gwall annisgwyl wedi digwydd. Rhowch gynnig arall arni.

source: Financial Assistance
cy: Cymorth ariannol

source: Upset Learner
cy: Dysgwr gofidus

source: Teaching Assistant
cy: Cynorthwy-ydd Addysgu

source: Please specify a reason.
cy: Rhowch reswm.

source: Something went wrong changing this enrollment. Please try again.
cy: Aeth rhywbeth o'i le wrth newid y cofrestriad hwn. Rhowch gynnig arall arni.

source: last activity
cy: gweithgarwch diwethaf

source: open slots
cy: slotiau agored

source: name
cy: enw

source: team count
cy: nifer yn y tîm

source: Teams
cy: Timau

source: Create
cy: Creu

source: Update
cy: Diweddaru

source: Team Name (Required)
cy: Enw'r tîm (gofynnol)

source: A name that identifies your team (maximum 255 characters).
cy: Enw sy'n dynodi eich tîm (mwyafswm 255 o nodau/gymeriadau).

source: Team Description (Required)
cy: Disgrifiad o'r tîm (gofynnol)

source: A short description of the team to help other learners understand the goals or direction of the team (maximum 300 characters).
cy: Disgrifiad byr o'r tîm i helpu dysgwyr eraill i ddeall y nodau neu gyfeiriad y tîm (mwyafswm 300 o nodau/gymeriadau).

source: Language
cy: Iaith

source: Location
cy: Lleoliad

source: Joined
cy: Ymunodd

source: Joined Date
cy: Dyddiad Ymuno

source: Birth Year
cy: Blwyddyn eni

source: The language that team members primarily use to communicate with each other.
cy: Yr iaith a ddefnyddir yn bennaf gan aelodau'r tîm i gyfathrebu gyda'i gilydd.

source: Country
cy: Gwlad

source: The country that team members primarily identify with.
cy: Y wlad mae aelodau'r tîm yn uniaethu â hi'n bennaf.

source: An error occurred. Please try again.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni.

source: Check the highlighted fields below and try again.
cy: Gwiriwch y meysydd sydd wedi'u amlygu isod a rhoi cynnig arall arni.

source: Enter team name.
cy: Rhowch enw'r tîm.

source: Team name cannot have more than 255 characters.
cy: Ni all enw'r tîm gynnwys mwy na 255 o nodau/gymeriadau.

source: Enter team description.
cy: Rhowch ddisgrifiad o'r tîm.

source: Team description cannot have more than 300 characters.
cy: Ni all disgrifiad y tîm gynnwys mwy na 300 o nodau/gymeriadau.

source: An error occurred while removing the member from the team. Try again.
cy: Cafwyd gwall wrth ddileu aelod o'r tîm. Rhowch gynnig arall arni.

source: This team does not have any members.
cy: Nid oes unrhyw aelodau gan y tîm hwn.

source: Joined %(date)s
cy: Ymunwyd %(date)s

source: Last Activity %(date)s
cy: %(date)s y gweithgarwch diwethaf

source: Remove this team member?
cy: Dileu'r aelod tîm hwn?

source: This learner will be removed from the team, allowing another learner to take the available spot.
cy: Bydd y dysgwr hwn yn cael ei ddileu o'r tîm, gan ganiatáu i ddysgwr arall gymryd ei le.

source: Delete this team?
cy: Dileu'r tîm hwn?

source: Deleting a team is permanent and cannot be undone. All members are removed from the team, and team discussions can no longer be accessed.
cy: Mae dileu tîm yn barhaol ac ni ellir ei ddad-wneud. Caiff pob aelod ei dynnu oddi ar y tîm, ac ni ellir gweld trafodaethau tîm mwyach.

source: Team "{team}" successfully deleted.
cy: Tîm "{team}" wedi'i ddileu'n llwyddiannus.

source: You are not currently a member of any team.
cy: Nid ydych yn aelod o unrhyw dîm ar hyn o bryd.

source: and others
cy: ac eraill

source: Last activity %(date)s
cy: %(date)s y gweithgarwch diwethaf

source: View %(span_start)s %(team_name)s %(span_end)s
cy: Gweld %(span_start)s %(team_name)s %(span_end)s

source: An error occurred. Try again.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni.

source: Leave this team?
cy: Gadael y tîm hwn?

source: If you leave, you can no longer post in this team's discussions. Your place will be available to another learner.
cy: Os gadewch, ni chewch fwyach bostio yn nhrafodaethau'r tîm. Bydd eich lle ar gael i ddysgwr arall.

source: Confirm
cy: Cadarnhau

source: You already belong to another team.
cy: Rydych eisoes yn perthyn i dîm arall.

source: This team is full.
cy: Mae'r tîm hwn yn llawn.

source: All teams
cy: Pob tîm

source: Teams Pagination
cy: Tudalennu timau

source: Topics
cy: Pynciau

source: See all teams in your course, organized by topic. Join a team to collaborate with other learners who are interested in the same topic as you are.
cy: Gweld pob tîm ar eich cwrs, yn nhrefn pynciau. Ymunwch â thîm i gydweithio gyda dysgwyr eraill sydd â diddordeb yn yr un pwnc â chi.

source: My Team
cy: Fy nhîm

source: Browse
cy: Pori

source: Your request could not be completed. Reload the page and try again.
cy: Nid oedd modd cwblhau eich cais. Ail-lwythwch y dudalen a rhowch gynnig arall arni.

source: Your request could not be completed due to a server problem. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
cy: Nid oedd modd cwblhau eich cais. Ail-lwythwch y dudalen a rhowch gynnig arall arni. Os yw'r broblem yn parhau, cliciwch ar tab Help i adrodd am y broblem.

source: Team Search
cy: Chwilio tîm

source: Showing results for "{searchString}"
cy: Dangos canlyniadau ar gyfer "{searchString}"

source: Create a New Team
cy: Creu tîm newydd

source: Create a new team if you can't find an existing team to join, or if you would like to learn with friends you know.
cy: Creu tîm newydd os nad ydych yn gallu dod o hyd i dîm sydd eisoes yn bodoli i ymuno ag ef, neu os hoffech ddysgu gyda ffrindiau rydych yn eu hadnabod.

source: Edit Team
cy: Golygu tîm

source: If you make significant changes, make sure you notify members of the team before making these changes.
cy: Os byddwch yn gwneud newidiadau sylweddol, sicrhewch eich bod yn hysbysu aelodau'r tîm cyn gwneud y newidiadau hynny.

source: Membership
cy: Aelodaeth

source: You can remove members from this team, especially if they have not participated in the team's activity.
cy: Gallwch ddileu aelodau o'r tîm hwn, yn enwedig os nad ydynt wedi cymryd rhan yng ngweithgareddau'r tîm.

source: Search teams
cy: Chwilio'r timau

source: All Topics
cy: Pob pwnc

source: The page "{route}" could not be found.
cy: Ni ellir dod o hyd i "{route}" y dudalen.

source: The topic "{topic}" could not be found.
cy: Ni ellid dod o hyd i'r pwnc "{topic}".

source: The team "{team}" could not be found.
cy: Ni ellid dod o hyd i'r tîm "{team}".

source: %(team_count)s Team
cy: nifer yn y tîm

source: Topic
cy: Pwnc

source: View Teams in the %(topic_name)s Topic
cy: Gweld y timau ym mhwnc %(topic_name)

source: {browse_span_start}Browse teams in other topics{span_end} or {search_span_start}search teams{span_end} in this topic. If you still can't find a team to join, {create_span_start}create a new team in this topic{span_end}.
cy: {browse_span_start}Porwch dimau pynciau eraill{span_end} neu {search_span_start}chwilio'r timau{span_end} yn y pwnc hwn. Os nad ydych yn gallu dod o hyd i dîm i ymuno ag ef o hyd, gallwch {create_span_start}greu tîm newydd yn y pwnc hwn{span_end}.

source: All topics
cy: Pob pwnc

source: Open Calculator
cy: Agor cyfrifiannell

source: Close Calculator
cy: Cau'r gyfrifiannell

source: HTML preview of post
cy: Rhagolwg HTML o bostiad

source: Post body
cy: Postio corff

source: Insert Hyperlink
cy: Mewnosod hyperddolen

source: e.g. 'http://google.com'
cy: e.e. 'http://google.com'

source: Link Description
cy: Disgrifiad o'r ddolen

source: e.g. 'google'
cy: e.e. 'google'

source: Please provide a description of the link destination.
cy: Rhowch ddisgrifiad o gyrchfan y ddolen.

source: Insert Image (upload file or type URL)
cy: Mewnosod delwedd (llwytho ffeil neu fath URL i fyny)

source: Type in a URL or use the "Choose File" button to upload a file from your machine. (e.g. 'http://example.com/img/clouds.jpg')
cy: Rhowch URL neu ddefnyddiwch botwm "Dewis Ffeil" i lwytho ffeil i fyny o'ch peiriant. (e.e. 'http://example.com/img/clouds.jpg')

source: Image Description
cy: Disgrifiad o'r ddelwedd

source: Please describe this image or agree that it has no contextual value by checking the checkbox.
cy: Disgrifiwch y ddelwedd hon neu gytuno nad oes ganddo unrhyw werth cyd-destunol drwy wirio'r blwch gwirio.

source: e.g. 'Sky with clouds'. The description is helpful for users who cannot see the image.
cy: e.e. 'Awyr â chymylau'. Mae'r disgrifiad yn ddefnyddiol i ddysgwyr sy'n methu gweld y ddelwedd.

source: How to create useful text alternatives.
cy: Sut i greu testun amgen defnyddiol.

source: This image is for decorative purposes only and does not require a description.
cy: Mae'r ddelwedd hon at ddibenion addurn yn unig ac nid oes angen disgrifiad.

source: Markdown Editing Help
cy: Help gyda golygu Markdown

source: Please provide a valid URL.
cy: Rhowch URL dilys.

source: Bold (Ctrl+B)
cy: Bras (Ctrl+B)

source: Italic (Ctrl+I)
cy: Italig (Ctrl+I)

source: Hyperlink (Ctrl+L)
cy: Hyperddolen (Ctrl+L)

source: Code Sample (Ctrl+K)
cy: Sampl côd (Ctrl+K)

source: Image (Ctrl+G)
cy: Delwedd (Ctrl+G)

source: Numbered List (Ctrl+O)
cy: Rhestr rifiedig (Ctrl+O)

source: Bulleted List (Ctrl+U)
cy: Rhestr bwledi (Ctrl+U)

source: Heading (Ctrl+H)
cy: Pennawd (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
cy: Riwl llorweddol (Ctrl+R)

source: Undo (Ctrl+Z)
cy: Dad-wneud (Ctrl+Z)

source: Redo (Ctrl+Y)
cy: Ail-wneud (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
cy: Ail-wneud (Ctrl+Shift+Z)

source: strong text
cy: testun cryf

source: emphasized text
cy: testun wedi'i bwysleisio

source: enter link description here
cy: rhowch ddisgrifiad o'r ddolen yma

source: enter code here
cy: Rhowch gôd yma

source: List item
cy: Rhestru eitem

source: Heading
cy: Pennawd

source: Preview this query
cy: Rhagweld yr ymholiad

source: All subsections
cy: Pob is-adrannau

source: All units
cy: Pob uned

source: Click to change
cy: Clicio i newid

source: Select a chapter
cy: Dewis pennod

source: Save changes
cy: Cadw'r newidiadau

source: Please enter valid start date and time.
cy: Rhowch ddyddiad ac amser dechrau dilys.

source: Due date cannot be before start date.
cy: Ni all y dyddiad dychwelyd fod cyn y dyddiad dechrau.

source: Enter Due Date and Time
cy: Rhowch ddyddiad ac amser dychwelyd

source: Enter Start Date and Time
cy: Rhowch ddyddiad ac amser dechrau

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
cy: Mae'r maes enw defnyddiwr/e-bost y myfyriwr yn ofynnol ac ni all fod yn wag.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
cy: Mae'r maes enw defnyddiwr/e-bost y myfyriwr yn ofynnol ac ni all fod yn wag.

source: Uploaded file issues. Click on "+" to view.
cy: Problemau wrth lwytho ffeil i fyny. Cliciwch ar "+" i weld.

source: learners are successfully added to exception list
cy: caiff y dysgwyr eu hychwanegu'n llwyddiannus i'r rhestr eithriadau

source: learner is successfully added to the exception list
cy: ychwanegwyd y dysgwr yn llwyddiannus i'r rhestr eithriadau

source: records are not in correct format and not added to the exception list
cy: nid yw'r cofnod yn y fformat cywir ar y cwrs ac nid yw wedi'i ychwanegu at yr eithriadau

source: record is not in correct format and not added to the exception list
cy: nid yw'r cofnod yn y fformat cywir ar y cwrs ac nid yw wedi'i ychwanegu at yr eithriadau

source: learners do not exist in LMS and not added to the exception list
cy: nid yw'r dysgwr yn bodoli yn LMS ac nid yw wedi'i ychwanegu i'r rhestr eithriadau

source: learner does not exist in LMS and not added to the exception list
cy: nid yw'r dysgwr yn bodoli yn LMS ac nid yw wedi'i ychwanegu i'r rhestr eithriadau

source: learners are already white listed and not added to the exception list
cy: Mae'r dysgwr eisoes ar y rhestr ganiatáu a heb ei ychwanegu at yr eithriadau

source: learner is already white listed and not added to the exception list
cy: Mae'r dysgwr eisoes ar y rhestr ganiatáu a heb ei ychwanegu at yr eithriadau

source: learners are not enrolled in course and not added to the exception list
cy: nid yw'r dysgwr wedi'i gofrestru ar y cwrs ac nid yw wedi'i ychwanegu at yr eithriadau

source: learner is not enrolled in course and not added to the exception list
cy: nid yw'r dysgwr wedi'i gofrestru ar y cwrs ac nid yw wedi'i ychwanegu at yr eithriadau

source: Certificate of <%= user %> has already been invalidated. Please check your spelling and retry.
cy: Mae tystysgrif <%= user %> eisoes wedi cael ei annilysu. Gwiriwch eich sillafu a rhoi cynnig arall arni.

source: Certificate has been successfully invalidated for <%= user %>.
cy: Mae'r dystysgrif eisoes wedi cael ei annilysu ar gyfer <%= user %>.

source: Server Error, Please refresh the page and try again.
cy: Gwall gweinydd, adnewyddwch y dudalen a rhowch gynnig arall arni.

source: The certificate for this learner has been re-validated and the system is re-running the grade for this learner.
cy: Mae'r dystysgrif ar gyfer y dysgwr hwn wedi cael ei ail-wirio ac mae'r system yn ail-redeg gradd ar gyfer y dysgwr hwn.

source: Could not find Certificate Invalidation in the list. Please refresh the page and try again
cy: Ni fedrwyd dod o hyd i annilysiad tystysgrif ar y rhestr. Adnewyddwch y dudalen a rhowch gynnig arall arni

source: Student Removed from certificate white list successfully.
cy: Cafodd y myfyriwr ei ddileu o restr wen tystysgrifau yn llwyddiannus.

source: Could not find Certificate Exception in white list. Please refresh the page and try again
cy: Ni fedrwyd dod o hyd i eithriad tystysgrif ar y rhestr ganiatáu. Adnewyddwch y dudalen a rhowch gynnig arall arni

source: <%= user %> already in exception list.
cy: Mae <%= user %> eisoes ar y rhestr eithriadau.

source: <%= user %> has been successfully added to the exception list. Click Generate Exception Certificate below to send the certificate.
cy: Mae <%= user %> wedi cael ei ychwanegu'n llwyddiannus i'r rhestr eithriadau. Cliciwch ar Cynhyrchu tystysgrif eithrio isod i anfon y dystysgrif.

source: There has been an error processing your survey.
cy: Cafwyd gwall wrth brosesu eich arolwg.

source: Less
cy: Llai

source: Please enter a valid donation amount.
cy: Rhowch swm rhodd dilys.

source: Your donation could not be submitted.
cy: Ni fedrwyd cyflwyno'ch rhodd

source: An error occurred. Please try again later.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni nes ymlaen.

source: Viewing %s course
cy: Gweld %s cwrs

source: We couldn't find any results for "%s".
cy: Ni fedrem ddod o hyd i unrhyw ganlyniadau ar gyfer "%s".

source: There was an error, try searching again.
cy: Cafwyd gwall, ceisiwch chwilio eto.

source: An error has occurred. Make sure that you are connected to the Internet, and then try refreshing the page.
cy: Gwall wedi digwydd. Sicrhewch eich bod yn gysylltiedig â'r Rhyngrwyd, ac yna ceisiwch Ail-wneud y dudalen.

source: Hide notes
cy: Cuddio'r nodiadau

source: Notes visible
cy: Nodiadau'n weladwy

source: Show notes
cy: Dangos y nodiadau

source: Notes hidden
cy: Nodiadau'n gudd

source: Please enter a term in the {anchorStart} search field{anchorEnd}.
cy: Rhowch derm yn y {anchorStart} maes chwilio{anchorEnd}.

source: Current tab
cy: Tab cyfredol

source: Location in Course
cy: Lleoliad yn y cwrs

source: Recent Activity
cy: Gweithgarwch diweddar

source: No results found for "%(query_string)s". Please try searching again.
cy: Ni chafwyd canlyniadau ar gyfer "%(query_string)s". Ceisiwch chwilio eto.

source: Search Results
cy: Canlyniadau'r chwiliad

source: [no tags]
cy: [dim tagiau]

source: Unable to submit application
cy: Yn methu cyflwyno'r cais

source: An error has occurred. Check your Internet connection and try again.
cy: Gwall wedi digwydd. Gwiriwch eich cysylltiad Rhyngrwyd a rhoi cynnig arall arni.

source: Choose one
cy: Dewiswch un

source: We've encountered an error. Refresh your browser and then try again.
cy: Cafwyd gwall. Adnewyddwch y porwr a rhowch gynnig arall arni.

source: Selected tab
cy: Tab a ddewiswyd

source: Saved cohort
cy: Cohort wedi'i gadw

source: Error adding students.
cy: Gwall wrth ychwanegu myfyrwyr.

source: Enter a username or email.
cy: Rhowch enw defnyddiwr neu e-bost.

source: {numUsersAdded} student has been added to this cohort
cy: Ychwanegu myfyrwyr i'r cohort hwn

source: Unknown user: {user}
cy: Defnyddiwr anhysbys: {defnyddiwr}

source: There was an error when trying to add students:
cy: Cafwyd gwall yn ystod y broses llwytho i fyny.

source: View all errors
cy: Gweld yr holl wallau

source: You must specify a name for the cohort
cy: Rhaid i chi nodi enw ar gyfer y cohort

source: You did not select a content group
cy: Ni wnaethoch ddethol grŵp cynnwys

source: The selected content group does not exist
cy: Nid yw'r grŵp cynnwys a ddewisoch yn bodoli

source: The cohort cannot be saved
cy: Ni ellir cadw'r cohort

source: The cohort cannot be added
cy: Ni ellir ychwanegu'r cohort

source: You currently have no cohorts configured
cy: Nid oes gennych unrhyw gohortau wedi'u ffurfweddu ar hyn o bryd

source: Add Cohort
cy: Ychwanegu cohort

source: The {cohortGroupName} cohort has been created. You can manually add students to this cohort below.
cy: Mae'r cohort {cohortGroupName} wedi cael eu creu. Gallwch ychwanegu myfyrwyr eich hun i'r cohort isod.

source: Assign students to cohorts by uploading a CSV file.
cy: Aseiniwch fyfyrwyr i gohortau drwy lwytho ffeil CSV i fyny.

source: Choose a .csv file
cy: Dewis ffeil .csv

source: Only properly formatted .csv files will be accepted.
cy: Ffeiliau .csv a fformatiwyd yn gywir yn unig a gaiff eu derbyn.

source: Upload File and Assign Students
cy: Llwytho ffeil i fyny a dynodi myfyrwyr

source: Your file '{file}' has been uploaded. Allow a few minutes for processing.
cy: Mae eich ffeil '{file}' wedi cael ei lwytho i fyny. Caniatewch ychydig o funudau ar gyfer prosesu.

source: Cohorts Enabled
cy: Cohortau wedi'u galluogi

source: Cohorts Disabled
cy: Cohortau wedi'u hanalluogi

source: This course uses automatic cohorting for verified track learners. You cannot disable cohorts, and you cannot rename the manual cohort named '{verifiedCohortName}'. To change the configuration for verified track cohorts, contact your edX partner manager.
cy: Mae'r cwrs hwn yn defnyddio cohortio awtomataidd ar gyfer dysgwyr llwybr a ddilyswyd. Ni allwch analluogi cohortau ac ni allwch ailenwi'r cohort a elwir '{verifiedCohortName}'. I newid ffurfweddiad ar gyfer cohortau llwybr dilys, cysylltwch â'ch rheolwr partner edX.

source: This course has automatic cohorting enabled for verified track learners, but the required cohort does not exist. You must create a manually-assigned cohort named '{verifiedCohortName}' for the feature to work.
cy: Mae gan y cwrs hwn gohortu awtomataidd ar gyfer dysgwyr llwybr dilys, ond nid yw'r cohort gofynnol yn bodoli. Rhaid i chi greu cohort i'w aseinio o'r enw '{verifiedCohortName}'.

source: This course has automatic cohorting enabled for verified track learners, but cohorts are disabled. You must enable cohorts for the feature to work.
cy: Mae gan y cwrs hwn gohortu awtomataidd ar gyfer dysgwyr llwybr dilys, ond mae cohortau wedi cael eu hanalluogi. Rhaid i chi alluogi cohortau er mwyn i'r nodwedd weithio.

source: Allow students to generate certificates for this course?
cy: Caniatáu i fyfyrwyr gynhyrchu tystysgrifau ar gyfer y cwrs hwn?

source: Prevent students from generating certificates in this course?
cy: Atal myfyrwyr rhag creu tystysgrifau yn y cwrs hwn?

source: Start generating certificates for all students in this course?
cy: Dechrau cynhyrchu tystysgrifau ar gyfer pob myfyriwr ar y cwrs?

source: Error while generating certificates. Please try again.
cy: Gwall wrth gynhyrchu tystysgrifau. Rhowch gynnig arall arni.

source: Start regenerating certificates for students in this course?
cy: Dechrau ailgynhyrchu tystysgrifau ar gyfer pob myfyriwr ar y cwrs?

source: Error while regenerating certificates. Please try again.
cy: Gwall wrth ailgynhyrchu tystysgrifau. Rhowch gynnig arall arni.

source: Loading data...
cy: Llwytho data...

source: Error getting issued certificates list.
cy: Gwall wrth gynhyrchu rhestr tystysgrifau a ddyroddwyd.

source: Error generating proctored exam results. Please try again.
cy: Gwall wrth gynhyrchu canlyniadau arholiad procter. Rhowch gynnig arall arni.

source: Error generating survey results. Please try again.
cy: Gwall wrth gynhyrchu canlyniadau arolwg. Rhowch gynnig arall arni.

source: Error generating student profile information. Please try again.
cy: Gwall wrth gynhyrchu gwybodaeth proffil myfyriwr. Rhowch gynnig arall arni.

source: Loading
cy: Yn llwytho

source: Error getting student list.
cy: Gwall wrth gynhyrchu rhestr myfyrwyr.

source: Error generating list of students who may enroll. Please try again.
cy: Gwall wrth gynhyrchu rhestr o fyfyrwyr a allai gofrestru. Rhowch gynnig arall arni.

source: Error retrieving grading configuration.
cy: Gwall wrth adfer ffurfweddiad graddio.

source: Error generating grades. Please try again.
cy: Gwall wrth gynhyrchu graddau. Rhowch gynnig arall arni.

source: Error generating problem grade report. Please try again.
cy: Gwall wrth gynhyrchu adroddiad gradd problem. Rhowch gynnig arall arni.

source: Error generating ORA data report. Please try again.
cy: Gwall wrth gynhyrchu adroddiad data ORA. Rhowch gynnig arall arni.

source: There was a problem creating the report. Select "Create Executive Summary" to try again.
cy: Cafwyd problem wrth greu'r adroddiad. Dewiswch "Creu Crynodeb Weithredol" er mwyn ceisio eto.

source: Enter the enrollment code.
cy: Rhowch gôd cofrestru.

source: Cancel enrollment code
cy: Canslo côd cofrestru

source: Restore enrollment code
cy: Adfer côd cofrestru

source: Mark enrollment code as unused
cy: Marciwch y côd cofrestru heb ei ddefnyddio

source: Username
cy: Enw defnyddiwr

source: Email
cy: E-bost

source: Revoke access
cy: Diddymu caniatâd

source: Enter username or email
cy: Rhowch enw defnyddiwr neu e-bost

source: Please enter a username or email.
cy: Rhowch enw defnyddiwr neu e-bost.

source: Error changing user's permissions.
cy: Gwall wrth newid caniatadau defnyddiwr.

source: Could not find a user with username or email address '<%- identifier %>'.
cy: Ni fedrwyd canfod defnyddiwr gyda'r enw defnyddiwr neu'r cyfeiriad e-bost '<%- identifier %>'.

source: Error: User '<%- username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
cy: Gwall: Nid yw defnyddiwr '<%- username %>' wedi ysgogi ei gyfrif eto. Rhaid i ddefnyddwyr greu ac ysgogi eu cyfrifon cyn derbyn rôl.

source: Error: You cannot remove yourself from the Instructor group!
cy: Gwall: Ni chewch ddileu eich hun o grŵp hyfforddwr!

source: Errors
cy: Gwallau

source: The following errors were generated:
cy: Cynhyrchwyd y gwallau hyn:

source: Warnings
cy: Rhybuddion

source: The following warnings were generated:
cy: Cynhyrchwyd y rhybuddion hyn:

source: Success
cy: Llwyddiant

source: All accounts were created successfully.
cy: Cafodd pob cyfrif ei greu'n llwyddiannus.

source: Error adding/removing users as beta testers.
cy: Gwall wrth ychwanegu/ddileu defnyddwyr fel profwyr beta.
