Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: Saving
cy: Cadw

source: Delete
cy: Dileu

source: Cancel
cy: Canslo

source: Uploading
cy: Yn llwytho i fyny

source: Close
cy: Cau

source: Name
cy: Enw

source: Choose File
cy: Dewiswch ffeil

source: Unknown
cy: Anhysbys

source: Remove
cy: Dileu

source: Upload File
cy: Llwytho ffeil i fyny

source: Save
cy: Cadw

source: Advanced
cy: Uwch

source: Removing
cy: Yn dileu

source: Your changes have been saved.
cy: Mae eich newidiadau wedi cael eu cadw.

source: Error
cy: Gwall

source: Updating with latest library content
cy: Diweddaru gyda chynnwys diweddaraf y llyfrgell

source: Creating missing groups
cy: Creu grwpiau coll

source: {start_strong}{total}{end_strong} words submitted in total.
cy: {start_strong}{total}{end_strong} o eiriau wedi'u cyflwyno at ei gilydd.

source: Show Annotations
cy: Dangos yr anodiadau

source: Hide Annotations
cy: Cuddio'r anodiadau

source: Expand Instructions
cy: Ehangu'r cyfarwyddiadau

source: Collapse Instructions
cy: Cwympo'r cyfarwyddiadau

source: Commentary
cy: Sylwebaeth

source: Reply to Annotation
cy: Ymateb i'r anodiad

source: %(num_points)s point possible (graded, results hidden)
cy: {"one"=>"%(num_points) y pwyntiau sy'n bosibl (graded)", "other"=>"%(num_points) y pwyntiau sy'n bosibl (graded)"}

source: %(num_points)s point possible (ungraded, results hidden)
cy: {"one"=>"%(num_points) y pwyntiau sy'n bosibl (ungraded)", "other"=>"%(num_points) y pwyntiau sy'n bosibl (ungraded)"}

source: %(earned)s/%(possible)s point (graded)
cy: %(earned)s/%(possible)s pwyntiau (wedi’u graddio)

source: The grading process is still running. Refresh the page to see updates.
cy: Mae'r broses raddio'n parhau i redeg. Adnewyddwch y dudalen i weld diweddariadau.

source: Could not grade your answer. The submission was aborted.
cy: Ni ellid graddio eich ateb. Rhoddwyd y gorau i'r cyflwyno.

source: Submission aborted! Sorry, your browser does not support file uploads. If you can, please use Chrome or Safari which have been verified to support file uploads.
cy: Rhoddwyd y gorau i'r cyflwyno! Mae'n flin gennym, nid yw eich porwr yn cefnogi llwytho ffeiliau i fyny. Os gallwch, defnyddiwch Chrome neu Safari sydd wedi cael eu gwirio i gefnogi llwytho ffeiliau i fyny.

source: You submitted {filename}; only {allowedFiles} are allowed.
cy: Rydych wedi cyflwyno {filename}; {allowedFiles} yn unig a ganiateir.

source: Your file {filename} is too large (max size: {maxSize}MB).
cy: Mae eich ffeil {filename} yn rhy fawr (mwyafswm maint: {maxSize}MB).

source: You did not submit the required files: {requiredFiles}.
cy: Ni wnaethoch gyflwyno'r ffeiliau gofynnol: {requiredFiles}.

source: You did not select any files to submit.
cy: Ni wnaethoch ddethol unrhyw ffeiliau i'w cyflwyno.

source: {label}: {status}
cy: {label}: {statws}

source: This problem has been reset.
cy: Mae'r broblem hon wedi cael ei ailosod.

source: unsubmitted
cy: heb ei gyflwyno

source: Paragraph
cy: Paragraff

source: Preformatted
cy: Wedi'i fformatio eisoes

source: Heading 3
cy: Pennawd 3

source: Heading 4
cy: Pennawd 4

source: Heading 5
cy: Pennawd 5

source: Heading 6
cy: Pennawd 6

source: Add to Dictionary
cy: Ychwanegu i'r geiriadur

source: Align center
cy: Alinio i'r canol

source: Align left
cy: Alinio i'r chwith

source: Align right
cy: Alinio i'r dde

source: Alignment
cy: Aliniad

source: Alternative source
cy: Ffynhonnell amgen

source: Anchor
cy: Angor

source: Anchors
cy: Angorau

source: Author
cy: Awdur

source: Background color
cy: Lliw cefndir

source: Blocks
cy: Blociau

source: Body
cy: Corff

source: Bold
cy: Bras

source: Border color
cy: Lliw y border

source: Bottom
cy: Gwaelod

source: Bullet list
cy: Rhestr bwledi

source: Caption
cy: Pennawd

source: Cell padding
cy: Padin cell

source: Cell properties
cy: Priodoleddau cell

source: Cell spacing
cy: Bwlch rhwng celloedd

source: Cell type
cy: Math o gell

source: Center
cy: Canol

source: Circle
cy: Cylch

source: Clear formatting
cy: Fformatio clir

source: Code block
cy: Bloc côd

source: Code
cy: Côd

source: Color
cy: Lliw

source: Cols
cy: Colofnau

source: Column group
cy: Grŵp colofn

source: Column
cy: Colofn

source: Constrain proportions
cy: Cyfrannedd cyfyngu

source: Copy row
cy: Copïo rhes

source: Copy
cy: Copïo

source: Could not find the specified string.
cy: Ni ellid dod o hyd i'r llinyn penodol.

source: Custom color
cy: Lliw a ddewiswyd

source: Custom...
cy: Dewiswyd...

source: Cut row
cy: Torri rhes

source: Cut
cy: Torri

source: Decrease indent
cy: Lleihau mewnoli

source: Default
cy: Diofyn

source: Delete column
cy: Dileu'r golofn

source: Delete row
cy: Dileu'r rhes

source: Delete table
cy: Dileu'r tabl

source: Description
cy: Disgrifiad

source: Dimensions
cy: Dimensiynau

source: Document properties
cy: Priodoleddau'r ddogfen

source: Edit HTML
cy: Golygu HTML

source: Edit
cy: Golygu

source: Embed
cy: Plannu

source: Emoticons
cy: Emoticonau

source: Encoding
cy: Amgodio

source: File
cy: Ffeil

source: Find and replace
cy: Canfod ac amnewid

source: Find next
cy: Canfod nesaf

source: Find previous
cy: Canfod blaenorol

source: Find
cy: Canfod

source: Finish
cy: Gorffen

source: Font Family
cy: Teulu ffont

source: Font Sizes
cy: Maint ffont

source: Footer
cy: Troedyn

source: Format
cy: Fformat

source: Formats
cy: Fformatiau

source: Fullscreen
cy: Sgrîn lawn

source: General
cy: Cyffredinol

source: H Align
cy: Alinio H

source: Header 1
cy: Pennyn 1

source: Header 2
cy: Pennyn 2

source: Header 3
cy: Pennyn 3

source: Header 4
cy: Pennyn 4

source: Header 5
cy: Pennyn 5

source: Header 6
cy: Pennyn 6

source: Header cell
cy: Cell pennyn

source: Header
cy: Pennyn

source: Headers
cy: Penynnau

source: Heading 1
cy: Pennawd 1

source: Heading 2
cy: Pennawd 2

source: Headings
cy: Penawdau

source: Height
cy: Uchder

source: Horizontal line
cy: Llinell lorweddol

source: Horizontal space
cy: Bwlch llorweddol

source: HTML source code
cy: Côd ffynhonnell HTML

source: Ignore all
cy: Anwybyddu'r cyfan

source: Ignore
cy: Anwybyddu

source: Image description
cy: Disgrifiad o'r ddelwedd

source: Increase indent
cy: Cynyddu'r mewnoli

source: Inline
cy: Mewn-llinell

source: Insert column after
cy: Mewnosod colofn wedi

source: Insert column before
cy: Mewnosod colofn cyn

source: Insert date/time
cy: Mewnosod dyddiad/amser

source: Insert image
cy: Mewnosod delwedd

source: Insert link
cy: Mewnosod dolen

source: Insert row after
cy: Mewnosod rhes wedi

source: Insert row before
cy: Mewnosod rhes cyn

source: Insert table
cy: Mewnosod tabl

source: Insert template
cy: Mewnosod patrymlun

source: Insert video
cy: Mewnosod fideo

source: Insert
cy: Mewnosod

source: Insert/edit image
cy: Mewnosod/golygu delwedd

source: Insert/edit link
cy: Mewnosod/golygu dolen

source: Insert/edit video
cy: Mewnosod/golygu fideo

source: Italic
cy: Italig

source: Justify
cy: Unioni

source: Keywords
cy: Allweddeiriau

source: Left to right
cy: Chwith i'r dde

source: Left
cy: Chwith

source: Lower Alpha
cy: Alffa isaf

source: Lower Greek
cy: Groeg isaf

source: Lower Roman
cy: Rhufeinig isaf

source: Match case
cy: Rhowch yr un llythrennau mawr/bach

source: Merge cells
cy: Uno celloedd

source: Middle
cy: Canol

source: New document
cy: Dogfen newydd

source: New window
cy: Ffenestr newydd

source: Next
cy: Nesaf

source: No color
cy: Dim lliw

source: Nonbreaking space
cy: Bwlch heb doriad

source: None
cy: Dim

source: Numbered list
cy: Rhestr wedi'i rhifo

source: Page break
cy: Toriad tudalen

source: Paste as text
cy: Gludo fel testun

source: Paste is now in plain text mode. Contents will now be pasted as plain text until you toggle this option off.
cy: Mae gludo bellach mewn modd testun plaen. Bydd y cynnwys nawr yn cael ei ludo fel testun plaen hyd nes i chi doglo'r dewis hwn i ffwrdd.

source: Paste row after
cy: Gludo rhes olynol

source: Paste row before
cy: Gludo rhes flaenorol

source: Paste your embed code below:
cy: Gludwch eich côd plannu isod:

source: Paste
cy: Gludo

source: Poster
cy: Postiwr

source: Pre
cy: Cyn

source: Prev
cy: Blaenorol

source: Preview
cy: Rhagolwg

source: Print
cy: Argraffu

source: Redo
cy: Ail-wneud

source: Remove link
cy: Dileu'r ddolen

source: Replace all
cy: Amnewid y cyfan

source: Replace with
cy: Amnewid gyda

source: Replace
cy: Amnewid

source: Restore last draft
cy: Adfer y drafft diwethaf

source: Rich Text Area. Press ALT-F9 for menu. Press ALT-F10 for toolbar. Press ALT-0 for help
cy: Maes testun cyfoethog. Gwasgwch ALT-F9 am ddewislen. Gwasgwch ALT-F10 am far offer. Gwasgwch ALT-0 am help

source: Right to left
cy: O'r dde i'r chwith

source: Right
cy: Y dde

source: Robots
cy: Robotiaid

source: Row group
cy: Grŵp y rhes

source: Row properties
cy: Priodoleddau'r rhes

source: Row type
cy: Math o res

source: Row
cy: Rhes

source: Rows
cy: Rhesi

source: Scope
cy: Cwmpas

source: Select all
cy: Dewis y cyfan

source: Show blocks
cy: Dangos blociau

source: Show invisible characters
cy: Dangos cymeriadau anweladwy

source: Source code
cy: Côd ffynhonnell

source: Source
cy: Ffynhonnell

source: Special character
cy: Cymeriad arbennig

source: Spellcheck
cy: Gwirio sillafu

source: Split cell
cy: Hollti cell

source: Square
cy: Sgwâr

source: Start search
cy: Dechrau chwilio

source: Strikethrough
cy: Linell drwodd

source: Style
cy: Arddull

source: Subscript
cy: Is-ysgrif

source: Superscript
cy: Uwch-ysgrif

source: Table properties
cy: Priodoleddau y tabl

source: Table
cy: Tabl

source: Target
cy: Targed

source: Templates
cy: Patrymluniau

source: Text color
cy: Lliw y testun

source: Text to display
cy: Testun i'w arddangos

source: The URL you entered seems to be an email address. Do you want to add the required mailto: prefix?
cy: Mae'n debyg mai cyfeiriad e-bost yw'r URL a roesoch. Ydych chi am ychwanegu'r mailto gofynnol: rhagddodiad?

source: The URL you entered seems to be an external link. Do you want to add the required http:// prefix?
cy: Mae'n debyg mai dolen allanol yw'r URL a roesoch. Ydych chi am ychwanegu'r rhagddodiad http:// gofynnol?

source: Title
cy: Teitl

source: Tools
cy: Offer

source: Top
cy: Brig

source: Underline
cy: Tanlinellu

source: Undo
cy: Dad-wneud

source: Upper Alpha
cy: Alffa uchaf

source: Upper Roman
cy: Rhufeinig uchaf

source: V Align
cy: Alinio V

source: Vertical space
cy: Bwlch fertigol

source: View
cy: Gweld

source: Visual aids
cy: Cymhorthion gweledol

source: Whole words
cy: Geiriau cyfan

source: Width
cy: Lled

source: Words: {0}
cy: Geiriau: {0}

source: You have unsaved changes are you sure you want to navigate away?
cy: Mae gennych newidiadau heb eu cadw, ydych chi'n siŵr eich bod am lywio ymaith?

source: Your browser doesn't support direct access to the clipboard. Please use the Ctrl+X/C/V keyboard shortcuts instead.
cy: Nid yw eich porwr yn cefnogi mynediad uniongyrchol i'r clipfwrdd. Yn hytrach, defnyddiwch fysell hwylus Ctrl+X/C/V.

source: Click OK to have your username and e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
cy: Cliciwch OK i adael i'ch enw defnyddiwr a'ch cyfeiriad e-bost gael eu hanfon i gymhwysiad 3ydd parti. Cliciwch canslo i ddychwelyd i'r dudalen hon heb anfon eich gwybodaeth.

source: Click OK to have your username sent to a 3rd party application. Click Cancel to return to this page without sending your information.
cy: Cliciwch OK i adael i'ch enw defnyddiwr gael ei anfon i gymhwysiad 3ydd parti. Cliciwch canslo i ddychwelyd i'r dudalen hon heb anfon eich gwybodaeth.

source: Click OK to have your e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
cy: Cliciwch OK i adael i'ch cyfeiriad e-bost gael ei anfon i gymhwysiad 3ydd parti. Cliciwch canslo i ddychwelyd i'r dudalen hon heb anfon eich gwybodaeth.

source: incorrect
cy: anghywir

source: correct
cy: cywir

source: answer
cy: ateb

source: Short explanation
cy: Eglurhad byr

source: If you use the Advanced Editor, this problem will be converted to XML and you will not be able to return to the Simple Editor Interface. Proceed to the Advanced Editor and convert this problem to XML?
cy: Os ydych yn defnyddio'r Advanced Editor, bydd y broblem hon yn cael ei throsi i XML ac ni chewch ddychwelyd i Simple Editor Interface. Ewch ymlaen i Advanced Editor a throsi'r broblem hon i XML?

source: Explanation
cy: Esboniad

source: Sequence error! Cannot navigate to %(tab_name)s in the current SequenceModule. Please contact the course staff.
cy: Gwall mewn dilyniant! Ni ellir llywio i %(tab_name) yn y SequenceModule cyfredol. Cysylltwch â staff y cwrs.

source: Bookmarked
cy: Wedi rhoi nod tudalen

source: Play
cy: Chwarae

source: Pause
cy: Oedi

source: Mute
cy: Tewi

source: Unmute
cy: Dad-dewi

source: Exit full browser
cy: Gadael porwr llawn

source: Fill browser
cy: Llenwch y porwr

source: Speed
cy: Cyflymder

source: Volume
cy: Sain

source: Muted
cy: Wedi'i dewi

source: Very low
cy: Isel iawn

source: Low
cy: Isel

source: Average
cy: Cyfartalog

source: Loud
cy: Uchel

source: Very loud
cy: Uchel iawn

source: Maximum
cy: Mwyaf

source: This browser cannot play .mp4, .ogg, or .webm files.
cy: Ni all y porwr hwn chwarae ffeiliau .mp4, .ogg, or .webm.

source: Try using a different browser, such as Google Chrome.
cy: Ceisiwch ddefnyddio porwr gwahanol, megis Google Chrome.

source: High Definition
cy: Diffiniad uchel

source: off
cy: i ffwrdd

source: on
cy: ymlaen

source: Video ended
cy: Fideo wedi gorffen

source: Video position
cy: Safle'r fideo

source: %(value)s minute
cy: oddeutu munud

source: Click on this button to mute or unmute this video or press UP or DOWN buttons to increase or decrease volume level.
cy: Cliciwch ar y botwm hwn i dewi neu ddad-dewi'r fideo hwn neu wasgu botymau I FYNY neu I LAWR neu droi lefel y sain i lawr.

source: Adjust video volume
cy: Addaswch sain y fideo

source: Press UP to enter the speed menu then use the UP and DOWN arrow keys to navigate the different speeds, then press ENTER to change to the selected speed.
cy: Gwasgwch I FYNY i agor y ddewislen cyflymder ac yna gwasgu bysellau'r saethau I FYNY ac I LAWR i lywio'r cyflymderau gwahanol, ac yna wasgu ENTER i newid y cyflymder a ddewiswyd.

source: Adjust video speed
cy: Addaswch gyflymder y fideo

source: Video speed:
cy: Cyflymder y fideo:

source: Skip
cy: Neidio

source: Play video
cy: Chwarae'r fideo

source: Do not show again
cy: Peidiwch â dangos eto

source: Open language menu
cy: Agor y ddewislen iaith

source: Transcript will be displayed when you start playing the video.
cy: Bydd y trawsgrifiad yn ymddangos pan fyddwch yn dechrau chwarae'r fideo.

source: Activating a link in this group will skip to the corresponding point in the video.
cy: Bydd ysgogi dolen yn y grŵp hwn yn neisio i'r pwynt cyfatebol yn y fideo hwn.

source: Video transcript
cy: Trawsgrifiad y fideo

source: Start of transcript. Skip to the end.
cy: Dechrau trawsgrifiad. Neidio i'r diwedd.

source: End of transcript. Skip to the start.
cy: Diwedd y trawsgrifiad. Neidio i'r dechrau.

source: Press the UP arrow key to enter the language menu then use UP and DOWN arrow keys to navigate language options. Press ENTER to change to the selected language.
cy: Gwasgwch bysell saeth I FYNY i agor y ddewislen iaith ac yna ddefnyddio'r bysellau saeth I FYNY ac I LAWR i lywio'r dewisiadau iaith. Gwasgwch ENTER i newid i'r iaith a ddewiswyd.

source: Hide closed captions
cy: Cuddio'r capsiynau caeëdig

source: (Caption will be displayed when you start playing the video.)
cy: (Bydd y pennawd yn ymddangos pan fyddwch yn dechrau chwarae'r fideo.)

source: Turn on closed captioning
cy: Troi capsiynau caeedig ymlaen

source: Turn on transcripts
cy: Troi trawsgrifiadau ymlaen

source: Turn off transcripts
cy: Diffodd y trawsgrifiadau

source: Required field.
cy: Maes gofynnol.

source: Please do not use any spaces in this field.
cy: Peidiwch â defnyddio unrhyw fylchau yn y maes hwn.

source: Please do not use any spaces or special characters in this field.
cy: Peidiwch â defnyddio unrhyw fylchau neu nodau/gymeriadau arbennig yn y maes hwn.

source: Pagination
cy: Tudaleniad

source: Your request could not be completed. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
cy: Nid oedd modd cwblhau eich cais. Ail-lwythwch y dudalen a rhowch gynnig arall arni. Os yw'r broblem yn parhau, cliciwch ar tab Help i adrodd am y broblem.

source: Showing {firstIndex} out of {numItems} total
cy: Yn dangos {firstIndex} o gyfanswm o {numItems}

source: Showing {firstIndex}-{lastIndex} out of {numItems} total
cy: Yn dangos {firstIndex}-{lastIndex} o gyfanswm o {numItems}

source: Loading content
cy: Yn llwytho cynnwys

source: Your request could not be processed. Refresh the page and try again.
cy: Nid oedd modd prosesu eich cais. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Some images in this post have been omitted
cy: Mae rhai delweddau yn y postiad hwn wedi cael eu hepgor

source: image omitted
cy: delwedd wedi'i hepgor

source: You could not be subscribed to this post. Refresh the page and try again.
cy: Ni fedrwyd eich tanysgrifio i'r postiad hwn. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: You could not be unsubscribed from this post. Refresh the page and try again.
cy: Ni fedrwyd eich datanysgrifio i'r postiad hwn. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This response could not be marked as an answer. Refresh the page and try again.
cy: Ni fedrwyd marcio'r ymateb hwn fel ateb. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This response could not be unmarked as an answer. Refresh the page and try again.
cy: Ni fedrwyd dadfarcio'r ymateb hwn fel ateb. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This response could not be marked as endorsed. Refresh the page and try again.
cy: Ni fedrwyd marcio'r ymateb hwn fel wedi'i gadarnhau. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This response could not be unendorsed. Refresh the page and try again.
cy: Ni fedrwyd marcio'r ymateb hwn fel heb ei gadarnhau. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This vote could not be processed. Refresh the page and try again.
cy: Ni fedrwyd prosesu'r bleidlais hon. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This post could not be pinned. Refresh the page and try again.
cy: Ni fedrwyd pinio'r postiad hwn. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This post could not be unpinned. Refresh the page and try again.
cy: Ni fedrwyd dadbinio'r postiad hwn. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This post could not be flagged for abuse. Refresh the page and try again.
cy: Ni fedrwyd fflagio'r postiad hwn am gamddefnydd. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This post could not be unflagged for abuse. Refresh the page and try again.
cy: Ni fedrwyd dadfflagio'r postiad hwn am gamddefnydd. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This post could not be closed. Refresh the page and try again.
cy: Ni fedrwyd cau'r postiad hwn. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: This post could not be reopened. Refresh the page and try again.
cy: Ni fedrwyd ailagor y postiad hwn. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Hide Discussion
cy: Cuddio trafodaeth

source: This discussion could not be loaded. Refresh the page and try again.
cy: Ni fedrwyd llwytho'r drafodaeth hon. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Show Discussion
cy: Dangos y drafodaeth

source: Loading more threads
cy: Llwytho mwy o edefynnau

source: Additional posts could not be loaded. Refresh the page and try again.
cy: Ni ellid llwytho postiadau ychwanegol. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Current conversation
cy: Sgwrs gyfredol

source: Loading posts list
cy: Yn llwytho rhestr postiadau

source: No results found for {original_query}. Showing results for {suggested_query}.
cy: Ni chafwyd canlyniadau ar gyfer {original_query}.

source: No posts matched your query.
cy: Nid oes postiad yn cyd-fynd â'ch ymholiad.

source: Show posts by {username}.
cy: Dangos postiadau gan {username}.

source: The post you selected has been deleted.
cy: Mae'r postiad a ddewisoch wedi cael ei ddileu.

source: Responses could not be loaded. Refresh the page and try again.
cy: Ni ellid llwytho'r ymatebion. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Additional responses could not be loaded. Refresh the page and try again.
cy: Ni ellid llwytho ymatebion ychwanegol. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: {numResponses} other response
cy: Llwytho'r {numResponses} ymateb nesaf

source: {numResponses} response
cy: Llwytho'r {numResponses} ymateb nesaf

source: Showing all responses
cy: Dangos pob ymateb

source: Showing first response
cy: Dangos pob ymateb

source: Load all responses
cy: Llwytho'r holl ymatebion

source: Load next {numResponses} responses
cy: Llwytho'r {numResponses} ymateb nesaf

source: Are you sure you want to delete this post?
cy: Ydych chi'n siŵr eich bod am ddileu'r postiad hwn?

source: Your post will be discarded.
cy: Bydd eich postiad yn cael ei ddiystyru.

source: anonymous
cy: dienw

source: Are you sure you want to delete this comment?
cy: Ydych chi'n siŵr eich bod am ddileu'r sylw hwn?

source: This comment could not be deleted. Refresh the page and try again.
cy: Ni fedrwyd dileu'r sylw. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Are you sure you want to delete this response?
cy: Ydych chi'n siŵr eich bod am ddileu'r ymateb hwn?

source: The email address you've provided isn't formatted correctly.
cy: Nid yw'r cyfeiriad e-bost rydych wedi'i ddarparu wedi'i fformatio'n gywir.

source: %(field)s must have at least %(count)d characters.
cy: Rhaid i %(field) gael o leiaf %(count) o nodau/gymeriadau.

source: %(field)s can only contain up to %(count)d characters.
cy: Gall %(field) gynnwys hyd at %(count) o nodau/gymeriadau yn unig.

source: Please enter your %(field)s.
cy: Rhowch eich %(field)s.

source: Drop target image
cy: Gollwng y ddelwedd darged

source: dragging out of slider
cy: llusgo allan o'r llithrydd

source: dragging
cy: llusgo

source: dropped in slider
cy: gollyngwyd yn y llithrydd

source: dropped on target
cy: gollyngwyd ar y targed

source: %s ago
cy: %s yn ôl

source: %s from now
cy: %s o nawr

source: less than a minute
cy: llai na munud

source: about a minute
cy: oddeutu munud

source: %d minute
cy: tua %d munud

source: about an hour
cy: oddeutu awr

source: about %d hour
cy: tua %d awr

source: a day
cy: y dydd

source: %d day
cy: %d dydd

source: about a month
cy: oddeutu mis

source: about a year
cy: oddeutu blwyddyn

source: User
cy: Defnyddiwr

source: Annotation
cy: Anodiad

source: Start
cy: Dechrau

source: End
cy: Diwedd

source: #Replies
cy: #Ymatebion

source: Date posted
cy: Dyddiad a bostiwyd

source: More
cy: Mwy

source: My Notes
cy: Fy nodiadau

source: Instructor
cy: Hyfforddwr

source: Public
cy: Cyhoeddus

source: Search
cy: Chwilio

source: Users
cy: Defnyddwyr

source: Tags
cy: Tagiau

source: Annotation Text
cy: Testun anodi

source: Clear
cy: Clirio

source: Text
cy: Testun

source: Video
cy: Fideo

source: Image
cy: Delwedd

source: Reply
cy: Ymateb

source: Tags:
cy: Tagiau:

source: Check the box to remove all flags.
cy: Cliciwch y blwch i ddileu'r holl fflagiau.

source: Check the box to remove %(totalFlags)s flag.
cy: Cliciwch y blwch i ddileu'r holl fflagiau.

source: Check the box to remove %(count)s flag.
cy: Cliciwch y blwch i ddileu'r holl fflagiau.
