Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: Which timed transcript would you like to use?
cy: Pa drawsgrifiad a amserwyd yr hoffech ei ddefnyddio?

source: Error.
cy: Gwall.

source: Timed Transcript from %(filename)s
cy: Trawsgrifiad a amserwyd ar gyfer %(filename)s

source: Timed Transcript Found
cy: Canfuwyd trawsgrifiad a amserwyd

source: EdX has a timed transcript for this video. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript. If you want to replace this transcript, upload a new .srt transcript file.
cy: Mae gan EdX drawsgrifiad wedi'i amseru ar gyfer y fideo hwn. Os ydych am olygu'r trawsgrifiad hwn, gallwch lawrlwytho, golygu ac ail lwytho'r trawsgrifiad cyfredol i fyny. Os ydych am amnewid y trawsgrifiad hwn, llwythwch ffeil trawsgrifiad .srt newydd i fyny.

source: Upload New Transcript
cy: Llwytho trawsgrifiad newydd i fyny

source: Upload New .srt Transcript
cy: Llwytho trawsgrifiad .srt newydd i fyny

source: Download Transcript for Editing
cy: Lawrlwytho trawsgrifiad ar gyfer golygu

source: No EdX Timed Transcript
cy: Dim trawsgrifiad EdX a amserwyd

source: EdX doesn't have a timed transcript for this video in Studio, but we found a transcript on YouTube. You can import the YouTube transcript or upload your own .srt transcript file.
cy: Nid oes gan EdX drawsgrifiad wedi'i amseru ar gyfer y fideo hwn yn Studio, ond cawsom hyd i drawsgrifiad ar YouTube. Gallwch fewnforio'r trawsgrifiad YouTube neu lwytho eich ffeil trawsgrifiad .srt eich hun i fyny.

source: Import YouTube Transcript
cy: Mewnforio trawsgrifiad YouTube

source: No Timed Transcript
cy: Dim trawsgrifiad a amserwyd

source: EdX doesn\'t have a timed transcript for this video. Please upload an .srt file.
cy: Nid oes gan EdX drawsgrifiad wedi'i amseru ar gyfer y fideo hwn. Llwythwch ffeil .srt i fyny.

source: The timed transcript for this video on edX is out of date, but YouTube has a current timed transcript for this video.
cy: Mae'r trawsgrifiad a amserwyd ar gyfer y fideo ar edX wedi dyddio, ond mae gan YouTube drawsgrifiad a amserwyd cyfredol ar gyfer y fideo hwn.

source: Do you want to replace the edX transcript with the YouTube transcript?
cy: Ydych chi am amnewid y trawsgrifiad edX gyda'r trawsgrifiad YouTube?

source: Yes, replace the edX transcript with the YouTube transcript
cy: Ie, amnewidiwch y trawsgrifiad edX gyda'r trawsgrifiad YouTube

source: Timed Transcript Uploaded Successfully
cy: Llwythwyd trawsgrifiad a amserwyd i fyny yn llwyddiannus

source: EdX has a timed transcript for this video. If you want to replace this transcript, upload a new .srt transcript file. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript.
cy: Mae gan EdX drawsgrifiad wedi'i amseru ar gyfer y fideo hwn. Os ydych am amnewid y trawsgrifiad hwn, llwythwch ffeil trawsgrifiad .srt newydd i fyny. Os ydych am olygu'r trawsgrifiad hwn, gallwch lawrlwytho, golygu ac ail lwytho'r trawsgrifiad cyfredol i fyny.

source: Confirm Timed Transcript
cy: Cadarnhau trawsgrifiad a amserwyd

source: You changed a video URL, but did not change the timed transcript file. Do you want to use the current timed transcript or upload a new .srt transcript file?
cy: Gwnaethoch newid URL fideo, ond heb newid y ffeil trawsgrifiad a amserwyd. Os ydych am ddefnyddio'r trawsgrifiad aamserwyd cyfredol, llwythwch ffeil trawsgrifiad .srt newydd i fyny?

source: Use Current Transcript
cy: Defnyddio'r trawsgrifiad cyfredol

source: The email address you used to register with {platform_name}
cy: Nid yw'r cyfeiriad e-bost rydych wedi'i ddarparu wedi'i fformatio'n gywir.

source: RESET MY PASSWORD
cy: Ailosod fy Nghyfrinair

source: No email address provided.
cy: Mae angen cyfeiriad e-bost dilys

source: You entered {email}. If this email address is associated with your Proversity account, we will send a message with password reset instructions to this email address.
cy: {paragraphStart}Rhoesoch {boldStart}{email}{boldEnd}. Os yw'r cyfeiriad e-bost hwn yn gysylltiedig â'ch cyfrif {platform_name}, byddwn yn anfon neges gyda chyfarwyddiadau ailosod cyfrinair i'r cyfeiriad e-bost hwn.{paragraphEnd}

source: If you do not receive a password reset message, verify that you entered the correct email address, or check your spam folder.
cy: Os na chewch neges ailsefydlu cyfrinair, gwiriwch eich bod wedi cofnodi'r cyfeiriad e-bost cywir, neu wirio'ch ffolder sbam.

source: If you need further assistance, contact technical support.
cy: Os oes angen cymorth pellach arnoch, cysylltwch â chymorth technegol.

source: {"one"=>"%(earned)s/%(possible)s point (graded)", "other"=>"%(earned)s/%(possible)s points (graded)"}
cy: {"one"=>"%(earned)s/%(possible)s pwyntiau (wedi’u graddio)", "other"=>"%(earned)s/%(possible)s pwyntiau (wedi’u graddio)"}

source: {"one"=>"%(earned)s/%(possible)s point (ungraded)", "other"=>"%(earned)s/%(possible)s points (ungraded)"}
cy: {"one"=>"%(earned)s/%(possible)s pwynt (ungraded)", "other"=>"%(earned)s/%(possible)s pwynt (ungraded)"}

source: Answers to this problem are now shown. Navigate through the problem to review it with answers inline.
cy: Nid yw atebion y broblem hon wedi'u dangos. Llywiwch drwy'r broblem i'w hadolygu gydag atebion yn eu lle.

source: VideoPlayer: Element corresponding to the given selector was not found.
cy: VideoPlayer: Ni chanfuwyd yr elfen gyfatebol a roddwyd i'r detholydd.

source: {"one"=>"%(value)s hour", "other"=>"%(value)s hours"}
cy: {"one"=>"%(value)s awr", "other"=>"%(value)s awr"}

source: {"one"=>"%(value)s minute", "other"=>"%(value)s minutes"}
cy: {"one"=>"%(value)s munud", "other"=>"%(value)s munud"}

source: {"one"=>"%(value)s second", "other"=>"%(value)s seconds"}
cy: {"one"=>"%(value)s eiliad", "other"=>"%(value)s eiliad"}

source: {"one"=>"there is currently {numVotes} vote", "other"=>"there are currently {numVotes} votes"}
cy: {"one"=>"ar hyn o bryd ceir {numVotes} pleidlais", "other"=>"ar hyn o bryd ceir {numVotes} pleidlais"}

source: {"one"=>"{numVotes} Vote", "other"=>"{numVotes} Votes"}
cy: {"one"=>"{numVotes} pleidlais", "other"=>"{numVotes} pleidlais"}

source: {"one"=>"{numResponses} other response", "other"=>"{numResponses} other responses"}
cy: {"one"=>"{numResponses} ymateb arall", "other"=>"{numResponses} ymateb arall"}

source: {"one"=>"{numResponses} response", "other"=>"{numResponses} responses"}
cy: {"one"=>"{numResponses} ymateb", "other"=>"{numResponses} ymateb"}

source: {"one"=>"Showing first response", "other"=>"Showing first {numResponses} responses"}
cy: {"one"=>"Yr ymateb cyntaf", "other"=>"Yr {numResponses} ymateb cyntaf"}

source: {"one"=>"%d minute", "other"=>"%d minutes"}
cy: {"one"=>"%d munud", "other"=>"%d munud"}

source: {"one"=>"about %d hour", "other"=>"about %d hours"}
cy: {"one"=>"oddeutu %d awr", "other"=>"oddeutu %d awr"}

source: {"one"=>"%d day", "other"=>"%d days"}
cy: {"one"=>"%d diwrnod", "other"=>"%d diwrnod"}

source: {"one"=>"%d month", "other"=>"%d months"}
cy: {"one"=>"%d mis", "other"=>"%d mis"}

source: {"one"=>"%d year", "other"=>"%d years"}
cy: {"one"=>"%d blwyddyn", "other"=>"%d blwyddyn"}

source: {"one"=>"%(memberCount)s / %(maxMemberCount)s Member", "other"=>"%(memberCount)s / %(maxMemberCount)s Members"}
cy: {"one"=>"%(memberCount)s / %(maxMemberCount)s aelod", "other"=>"%(memberCount)s / %(maxMemberCount)s aelod"}

source: Your request could not be completed due to a server problem. Reload the page
cy: Ni fedrwyd cwblhau eich cais oherwydd problem gyda'r gweinydd. Ail-lwythwch y dudalen

source: {"one"=>"%(team_count)s Team", "other"=>"%(team_count)s Teams"}
cy: {"one"=>"%(team_count)s tîm", "other"=>"%(team_count)s tîm"}

source: Error getting student progress url for '<%= student_id %>'. Make sure that the student identifier is spelled correctly.
cy: Gwall wrth gyrchu url cynnydd myfyriwr ar gyfer '<%= student_id %>'. Sicrhewch bod dynodydd y myfyriwr wedi'i sillafu'n gywir.

source: Success! Problem attempts reset for problem '<%= problem_id %>' and student '<%= student_id %>'.
cy: Llwyddiant! Ailosodwyd y ceisiadau problem ar gyfer problem '<%= problem_id %>' a myfyriwr '<%= student_id %>'.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
cy: Gwall wrth ailosod ceisiadau problem ar gyfer problem '<%= problem_id %>' a myfyriwr '<%= student_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Delete student '<%= student_id %>'s state on problem '<%= problem_id %>'?
cy: Dileu cyflwr myfyriwr '<%- student_id %> ar broblem '<%- problem_id %>'?

source: Error deleting student '<%= student_id %>'s state on problem '<%= problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
cy: Gwall wrth ddileu cyflwr myfyriwr '<%- student_id %> ar broblem '<%= problem_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Started rescore problem task for problem '<%= problem_id %>' and student '<%= student_id %>'. Click the 'Show Background Task History for Student' button to see the status of the task.
cy: Dechreuwyd ail-sgorio tasg broblem ar gyfer problem '<%= problem_id %>' a myfyriwr '<%= student_id %>'. Cliciwch y botwm 'Dangos Hanes Tasg Gefndir y Myfyriwr i weld statws y dasg.

source: Error starting a task to rescore problem '<%= problem_id %>' for student '<%= student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
cy: Gwall wrth ddechrau tasg i ail-sgorio problem '<%= problem_id %>' ar gyfer myfyriwr '<%= student_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Error getting task history for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
cy: Gwall wrth gyrchu hanes tasg ar gyfer problem '<%= problem_id %>' a myfyriwr '<%= student_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Started entrance exam rescore task for student '{student_id}'. Click the 'Show Background Task History for Student' button to see the status of the task.
cy: Dechrau tasg ailfarcio arholiad mynediad ar gyfer myfyriwr '{student_id}'. Cliciwch y botwm 'Dangos Hanes Tasg Gefndir y Myfyriwr i weld statws y dasg.

source: Reset attempts for all students on problem '<%= problem_id %>'?
cy: Ail-osod ceisiadau ar gyfer pob myfyriwr ar gyfer problem '<%= problem_id %>'?

source: Successfully started task to reset attempts for problem '<%= problem_id %>'. Click the 'Show Background Task History for Problem' button to see the status of the task.
cy: Dechreuwyd tasg i ailosod ceisiadau ar gyfer y broblem yn llwyddiannus '<%= problem_id %>'. Cliciwch y botwm 'Dangos Hanes Tasg Gefndir y Broblem' i weld statws y dasg.

source: Error starting a task to reset attempts for all students on problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
cy: Gwall wrth ddechrau tasg i ail-osod ceisiadau ar gyfer yr holl fyfyrwyr ar gyfer problem '<%= problem_id %>'. Sicrhewch bod dynodydd y broblem yn gyflawn ac yn gywir.

source: Rescore problem '<%= problem_id %>' for all students?
cy: Ail-sgorio problem '<%= problem_id %>' ar gyfer pob myfyriwr?

source: Successfully started task to rescore problem '<%= problem_id %>' for all students. Click the 'Show Background Task History for Problem' button to see the status of the task.
cy: dechreuwyd tasg i ail-sgorio problem '<%= problem_id %>' yn llwyddiannus. Cliciwch y botwm 'Dangos Hanes Tasg Gefndir y Broblem' i weld statws y dasg.

source: Error starting a task to rescore problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
cy: Gwall wrth ddechrau tasg i ail-sgorio problem '<%= problem_id %>'. Sicrhewch bod dynodydd y broblem yn gyflawn ac yn gywir.

source: {"one"=>"%(errorCount)s error found in form.", "other"=>"%(errorCount)s errors found in form."}
cy: {"one"=>"Cafuwyd %(errorCount)s gwall yn y ffurflen.", "other"=>"Canfuwyd %(errorCount)s gwall yn y ffurflen."}

source: You have been logged out of your edX account.
cy: Rydych wedi cael eich allgofnodi o'ch cyfrif edX.

source: Click to add
cy: Cliciwch i ychwanegu

source: Bookmark this page
cy: Rhoi nod tudalen yma

source: Click to remove
cy: Cliciwch i ddileu

source: records are not in correct format and not added to
cy: nid yw'r cofnodion yn y fformat cywir ac nid ydynt wedi'u hychwanegu at

source: learners do not exist in LMS and not added to the
cy: nid yw'r dysgwyr yn bodoli yn LMS ac nid ydynt wedi'u hychwanegu at y

source: learners are already white listed and not added to
cy: mae'r dysgwyr eisoes ar y rhestr ganiatáu a heb eu hychwanegu at

source: learners are not enrolled in course and not added to
cy: nid yw'r dysgwyr wedi'u cofrestru ar y cwrs ac nid ydynt wedi'u hychwanegu at

source: {"one"=>"{numUsersAdded} student has been added to this cohort", "other"=>"{numUsersAdded} students have been added to this cohort"}
cy: {"one"=>"Ychwanegwyd {numUsersAdded} myfyriwr i'r cohort hwn", "other"=>"Ychwanegwyd {numUsersAdded} myfyriwr i'r cohort hwn"}

source: {"one"=>"{numMoved} student was removed from {oldCohort}", "other"=>"{numMoved} students were removed from {oldCohort}"}
cy: {"one"=>"Dilëwyd{numMoved} myfyriwr o {oldCohort}", "other"=>"Dilëwyd{numMoved} myfyriwr o {oldCohort}"}

source: {"one"=>"{numPresent} student was already in the cohort", "other"=>"{numPresent} students were already in the cohort"}
cy: {"one"=>"Roedd {numPresent} myfyriwr eisoes yn y cohort", "other"=>"Roedd {numPresent} myfyriwr eisoes yn y cohort"}

source: {"one"=>"There was an error when trying to add students:", "other"=>"There were {numErrors} errors when trying to add students:"}
cy: {"one"=>"Cafwyd gwall wrth geisio ychwanegu myfyrwyr:", "other"=>"Cafwyd {numErrors} gwall wrth geisio ychwanegu myfyrwyr:"}

source: {"one"=>"%s result", "other"=>"%s results"}
cy: {"one"=>"%s canlyniac", "other"=>"%s canlyniac"}

source: You have successfully signed into %(currentProvider)s, but your %(currentProvider)s
cy: Rydych wedi mewngofnodi'n llwyddiannus i %(currentProvider), ond eich %(currentProvider)s

source: Unable to retrieve data, please try again later.
cy: Yn methu adfer data, rhowch gynnig arni nes ymlaen.

source: {"one"=>"%(num_students)s student opened Subsection", "other"=>"%(num_students)s students opened Subsection"}
cy: {"one"=>"agorodd %(num_students)s myfyriwr is-adran", "other"=>"agorodd %(num_students)s o fyfyrwyr is-adran"}

source: {"one"=>"%(num_students)s student", "other"=>"%(num_students)s students"}
cy: {"one"=>"%(num_students)s myfyriwr", "other"=>"%(num_students)s o fyfyrwyr"}

source: {"one"=>"%(num_questions)s question", "other"=>"%(num_questions)s questions"}
cy: {"one"=>"%(num_questions)s cwestiwn", "other"=>"%(num_questions)s o gwestiynau"}

source: Add a clear and descriptive title to encourage participation.
cy: Ychwanegu teitl clir a disgrifiadol i annog cyfranogiad.

source: %(post_type)s posted %(time_ago)s by %(author)s
cy: %(post_type) wedi'i bostio %(time_ago) yn ôl gan %(author)

source: My Bookmarks
cy: Fy nodau tudalen

source: You have earned certificates in %(completed_courses)s of the %(total_courses)s courses so far.
cy: Rydych wedi ennill tystysgrifau yn %(completed_courses)s o'r %(total_courses)s cwrs hyd yma.

source: This content group is used in:
cy: Defnyddir y grŵp cynnwys hwn yn:

source: Draft saved on %(last_saved_date)s by %(edit_username)s
cy: Cadwyd y drafft ar %(last_saved_date)s gan %(edit_username)s

source: Course Type
cy: Math y Cwrs

source: This is what you will use to login.
cy: Dyma beth fyddwch chi'n ei ddefnyddio i fewngofnodi.

source: This name will be used on any certificates that you earn.
cy: Bydd yr enw hwn yn cael ei ddefnyddio ar unrhyw dystysgrifau rydych chi'n eu ennill.

source: The name that will identify you in your courses. It cannot be changed later.
cy: Yr enw a fydd yn eich adnabod yn eich cyrsiau. Ni ellir ei newid yn nes ymlaen.

source: Enter a valid email address that contains at least 3 characters.
cy: Rhowch gyfeiriad e-bost dilys sy'n cynnwys o leiaf 3 nod.

source: Enter a valid email address that contains at least 3 characters. This is what you will use to login
cy: Rhowch gyfeiriad e-bost dilys sy'n cynnwys o leiaf 3 nod. Dyma beth fyddwch chi'n ei ddefnyddio i fewngofnodi.

source: Enter a valid email address that contains at least {min} characters.
cy: Rhowch gyfeiriad e-bost dilys sy'n cynnwys o leiaf {min} nod.

source: Enter your full name. This name will be used on any certificates that you earn
cy: Rhowch eich enw llawn. Bydd yr enw hwn yn cael ei ddefnyddio ar unrhyw dystysgrifau rydych chi'n eu ennill

source: Enter your full name.
cy: Rhowch eich enw llawn.

source: Enter a password.
cy: Rhowch gyfrinair.

source: Country or Region of Residence
cy: Gwlad neu Ranbarth Preswyl

source: Password (required)
cy: Cyfrinair (gofynnol)

source: Country or Region of Residence (required)!
cy: Gwlad neu Ranbarth Preswyl (gofynnol)!

source: Select your country or region of residence.
cy: Dewiswch eich gwlad neu ranbarth preswylio.

source: (required)
cy: (gofynnol)

source: required
cy: gofynnol

source: Support education research by providing additional information
cy: Cefnogi ymchwil addysg trwy ddarparu gwybodaeth ychwanegol

source: I agree to the {platform_name} {terms_of_service}
cy: Rwy'n cytuno i {platform_name} {terms_of_service}

source: I agree to the {link_start}Terms of Service{link_end}
cy: Cytunaf i'r {link_start}Telerau Gwasanaeth{link_end}

source: I agree to the {link_start}Terms of Service and Honor Code{link_end}
cy: Cytunaf i'r {link_start} Telerau Gwasanaeth{link_end}

source: Got it!
cy: Wedi'i gael!

source: Pass
cy: Pasiwch

source: Learner's {platform_name} email address or username
cy: Cyfeiriad e-bost neu enw defnyddiwr {platform_name} y dysgwr

source: Location of problem in course
cy: Lleoliad y broblem yn y cwrs

source: Location of problem in course *
cy: Lleoliad y broblem yn y cwrs *

source: For the specified problem, override the learner's score.
cy: Ar gyfer y broblem a nodwyd, yn diystyru sgôr y dysgwr.yn llwyr o'r gronfa ddata.

source: The enrolled learner profile report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad proffil dysgwyr cofrestredig yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: First time here?
cy: Y tro cyntaf yma?

source: Create an Account.
cy: Creu cyfrif.

source: Sign In
cy: Mewngofnodi

source: Score Override
cy: sgôr diweddaru

source: Are you sure you want to unenroll from the purchased course %(course_name)s (%(course_number)s)?
cy: Ydych chi'n siŵr eich bod am ddadgofrestru o'r cwrs a brynoch %(course_name)s (%(course_number)s)?

source: Are you sure you want to unenroll from %(course_name)s (%(course_number)s)?
cy: Ydych chi'n siŵr eich bod am ddadgofrestru o %(course_name)s (%(course_number)s)?

source: Course Home Sidebar
cy: Enw bar ochr hafan y cwrs

source: Course Home Sidebar Name
cy: Enw bar ochr hafan y cwrs

source: Course Tools
cy: Rolau tîm y cwrs

source: The name that identifies you on {platform_name}. You cannot change your username.
cy: Yr enw sy'n eich adnabod chi ar {platform_name}. Ni allwch newid eich enw defnyddiwr.

source: The name that is used for ID verification and that appears on your certificates.
cy: Yr enw a ddefnyddir ar gyfer gwirio pwy ydych chi ac sy'n ymddangos ar eich tystysgrifau

source: Check your email account for instructions to reset your password.
cy: Gwiriwch eich cyfrif e-bost am gyfarwyddiadau i ailosod eich cyfrinair.

source: The language used throughout this site. This site is currently available in a limited number of languages. Changing the value of this field will cause the page to refresh.
cy: Yr iaith a ddefnyddiwyd trwy gydol y safle hwn. Mae'r safle hwn ar gael ar hyn o bryd mewn nifer cyfyngedig o ieithoedd. Bydd newid gwerth y maes hwn yn achosi'r dudalen i adnewyddu.

source: Optionally, link your personal accounts to the social media icons on your edX profile.
cy: Yn ddewisol, cysylltwch eich cyfrifon personol i'r eiconau cyfryngau cymdeithasol ar eich proffil edX.

source: Enter your
cy: Rhowch eich

source: username or the URL to your
cy: enw defnyddiwr neu'r URL i chi

source: page. Delete the URL to remove the link.
cy: tudalen. Dileu'r URL i gael gwared ar y ddolen.

source: Course Certificates
cy: Tystysgrifau'r cwrs

source: Profile Visibility:
cy: Gwelededd Proffil:

source: Create Account
cy: Creu cyfrif

source: Already have an {platformName} account?
cy: Eisoes sydd â {platformName} nghyfrif?

source: Sign in.
cy: Mewngofnodi.

source: You receive messages from {platform_name} and course teams at this address.
cy: Rydych chi'n derbyn negeseuon gan {platform_name} a thimau cwrs yn y cyfeiriad hwn.

source: The country or region where you live.
cy: Y wlad neu'r rhanbarth lle rydych chi'n byw.

source: Select your country or region of residence. The country or region where you live.
cy: Dewiswch eich gwlad neu ranbarth preswylio. Y wlad neu'r rhanbarth lle rydych chi'n byw.

source: (optional)
cy: (dewisol)

source: Select the highest level of education you have completed.
cy: Dewiswch y lefel uchaf o addysg yr ydych wedi'i gwblhau.

source: Or explore other courses
cy: Neu archwilio ar gyrsiau eraill

source: Options
cy: Opsiynau

source: Learn more
cy: Dysgu mwy

source: Enrolment in this course is by invitation only
cy: Gellir ond cofrestru ar y cwrs hwn drwy wahoddiad yn unig

source: Problem Scores:
cy: Sgoriau problem:

source: Practice Scores:
cy: Sgoriau ymarfer:

source: Learner's {platform_name} email address or username *
cy: Cyfeiriad e-bost neu enw defnyddiwr {platform_name} y dysgwr *

source: Learner's {platform_name} email address or username
cy: Cyfeiriad e-bost neu enw defnyddiwr {platform_name} y dysgwr

source: To generate a CSV file that lists all student answers to a given problem, enter the location of the problem (from its Staff Debug Info).
cy: I gynhyrchu ffeil CSV sy'n rhestru holl atebion y myfyrwyr i broblem benodol, rhowch leoliad y broblem (o'r wybodaeth dadfygio staff).

source: Problem location:
cy: Lleoliad y broblem:

source: Certificate exceptions group selection
cy: Hanes cynhyrchu tystysgrifau

source: These settings include basic information about your account.
cy: Mae'r lleoliadau hyn yn cynnwys gwybodaeth sylfaenol am eich cyfrif.

source: Email Address (Sign In)
cy: Cyfeiriad E-bost (Mewngofnodwch)

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
cy: Sylwer: Mae tîm cefnogi {platform_name} yn siarad Saesneg. Er y gwnawn ein gorau i ateb eich ymholiad mewn unrhyw iaith, bydd ein hymatebion yn Saesneg.

source: To generate a CSV file that lists all student answers to a given problem, enter the location of the problem (from its Staff Debug Info).
cy: I greu ffeil CSV sy'n rhestru'r holl atebion i fyfyrwyr i broblem benodol, fynd i mewn i'r lleoliad y broblem (o'i Debug Staff info).
