Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: Course pacing cannot be changed once a course has started.
cy: Ni ellir newid cyflymder y cwrs wedi i gwrs ddechrau.

source: {hours}:{minutes} (current UTC time)
cy: {hours}:{minutes} (amser UTC cyfredol)

source: Upload your course image.
cy: Llwytho eich delwedd cwrs i fyny.

source: Upload your banner image.
cy: Llwytho eich delwedd baner i fyny.

source: Upload your video thumbnail image.
cy: Llwytho eich cryno ddelwedd fideo i fyny.

source: Delete “<%= name %>”?
cy: Dileu “<%= name %>”?

source: Deleting a textbook cannot be undone and once deleted any reference to it in your courseware's navigation will also be removed.
cy: Ni ellir dad-wneud dileu gwerslyfr ac wedi ei ddileu bydd unrhyw gyfeiriad ato yn eich deunydd cwrs hefyd yn cael ei ddileu.

source: Delete Page Confirmation
cy: Dileu tudalen gadarnhad

source: Are you sure you want to delete this page? This action cannot be undone.
cy: Ydych chi'n siŵr eich bod am ddileu'r dudalen hon? Ni ellir dadwneud y weithred hon.

source: Upload
cy: Llwytho i fyny

source: We're sorry, there was an error
cy: Mae'n flin gennym, cafwyd gwall

source: The combined length of the organization, course number, and course run fields cannot be more than <%=limit%> characters.
cy: Ni chaiff hyd cyfun y meysydd sefydliad, rhif y cwrs, rhediad y cwrs fod yn fwy na <%=limit%> o nodau/gymeriadau.

source: The combined length of the organization and library code fields cannot be more than <%=limit%> characters.
cy: Ni chaiff hyd cyfun y meysydd sefydliad a chôd llyfrgell fod yn fwy na <%=limit%> o nodau/gymeriadau.

source: Undo move
cy: Dad-wneud

source: Take me to the new location
cy: Ewch â fi i brif dudalen y cwrs

source: Duplicating
cy: Dyblygu

source: Undo moving
cy: Yn dileu

source: Moving
cy: Yn dileu

source: Deleting this {xblock_type} is permanent and cannot be undone.
cy: Mae dileu {xblock_type}yn barhaol ac ni ellir ei ddad-wneud.

source: Any content that has listed this content as a prerequisite will also have access limitations removed.
cy: Bydd unrhyw gynnwys sydd wedi rhestru'r cynnwys hwn yn ofynnol hefyd yn gweld cyfyngiadau mynediad yn diflannu.

source: Delete this {xblock_type} (and prerequisite)?
cy: Dileu {xblock_type) (a'r rhagofyniad)?

source: Yes, delete this {xblock_type}
cy: Ie, dileu {xblock_type}

source: Delete this {xblock_type}?
cy: Dileu {xblock_type}?

source: section
cy: adran

source: subsection
cy: is-adran

source: unit
cy: uned

source: You've made some changes
cy: Rydych wedi gwneud rhai newidiadau

source: Your changes will not take effect until you save your progress.
cy: Ni fydd eich newidiadau'n weithredol nes i chi gadw eich cynnydd.

source: You've made some changes, but there are some errors
cy: Rydych wedi gwneud rhai newidiadau, ond mae gwallau o hyd

source: Please address the errors on this page first, and then save your progress.
cy: Datryswch y gwallau ar y dudalen hon, ac yna gadw eich cynnydd.

source: Save Changes
cy: Cadw'r newidiadau

source: Please select a file in .srt format.
cy: Dewiswch ffeil fformat .srt.

source: Error: Uploading failed.
cy: Gwall: Llwytho i fyny wedi methu.

source: Error: Import failed.
cy: Gwall: Mewnforio wedi methu.

source: Error: Replacing failed.
cy: Gwall: Methwyd amnewid.

source: Error: Choosing failed.
cy: Gwall: Dewis wedi methu.

source: Error: Connection with server failed.
cy: Gwall: Methodd y cysylltiad â'r gweinydd.

source: No sources
cy: Dim ffynonellau

source: Link types should be unique.
cy: Dylai'r mathau o ddolenni fod yn unigryw.

source: Links should be unique.
cy: Dylai'r dolenni fod yn unigryw.

source: Incorrect url format.
cy: Fformat url anghywir.

source: Sorry, there was an error parsing the subtitles that you uploaded. Please check the format and try again.
cy: Mae'n flin gennym, cafwyd gwall wrth ddosrannu'r is-deitlau y gwnaethoch eu llwytho i fyny. Gwiriwch y fformat a rhowch gynnig arall arni.

source: Upload translation
cy: Llwytho cyfieithiad i fyny

source: Editor
cy: Golygydd

source: Settings
cy: Gosodiadau

source: New {component_type}
cy: {component_type} newydd

source: Warning
cy: Rhybudd

source: Updating Tags
cy: Diweddaru tagiau

source: Actions
cy: Gweithredoedd

source: Timed Exam
cy: Arholiad a amserir

source: Unscheduled
cy: Annisgwyl

source: Date
cy: Dyddiad

source: Previous
cy: Blaenorol

source: Status
cy: Statws

source: Action
cy: Gweithred

source: Large
cy: Mawr

source: Zoom In
cy: Nesáu

source: Zoom Out
cy: Pellhau

source: Return to course outline
cy: Dychwelyd i restr y timau

source: Outline
cy: Amlinelliad o'r cwrs

source: Page number out of %(total_pages)s
cy: Rhif tudalen allan o %(total_pages)

source: Enter the page number you'd like to quickly navigate to.
cy: Rhowch rif y dudalen rydych am lywio iddi'n gyflym.

source: Sorted by
cy: Trefnwyd yn ôl

source: Clear search
cy: Clirio'r chwiliad

source: Mark as Answer
cy: Marcio fel ateb

source: Unmark as Answer
cy: Dadfarcio fel ateb

source: Open
cy: Agor

source: Endorse
cy: Cadarnhau

source: Unendorse
cy: Dadgadarnhau

source: Follow
cy: Dilyn

source: Unfollow
cy: Gorffen dilyn

source: Unpin
cy: Dadbinio

source: Report abuse
cy: Adrodd am gamddefnydd

source: Report
cy: Adrodd am hyn

source: Unreport
cy: Dadwneud yr adrodd

source: Vote for this post,
cy: Pleidleisio am y postiad hwn,

source: Load more
cy: Llwytho mwy

source: Error posting your message.
cy: Gwall wrth bostio eich neges.

source: Add a Post
cy: Ychwanegu postiad

source: Visible to
cy: Yn weladwy i

source: Discussion admins, moderators, and TAs can make their posts visible to all students or specify a single cohort.
cy: Gall gweinyddwyr trafodaethau, cymedrolwyr, a CA wneud eu postiadau yn weladwy i'r holl fyfyrwyr neu nodi cohort penodol.

source: All Groups
cy: Pob grŵp

source: Add a clear and descriptive title to encourage participation. (Required)
cy: Ychwanegu teitl clir a disgrifiadol i annog cyfranogiad. (Gofynnol)

source: Your question or idea (required)
cy: Eich cwestiwn neu syniad (gofynnol)

source: follow this post
cy: dilyn y postiad

source: post anonymously
cy: Postio'n ddienw

source: post anonymously to classmates
cy: Postio'n ddienw i gydfyfyrwyr

source: Submit
cy: Cyflwyno

source: (Community TA)
cy: CD cymunedol

source: This thread is closed.
cy: Mae'r edefyn ar gau.

source: View discussion
cy: Gweld y drafodaeth

source: Editing comment
cy: Sylw am y golygu

source: Update comment
cy: Diweddaru sylw

source: posted %(time_ago)s by %(author)s
cy: postiwyd %(time_ago) yn ôl gan %(author)

source: Reported
cy: Adroddwyd

source: Editing post
cy: Golygu postiad

source: Edit your post below.
cy: Golygu eich postiad isod.

source: Update post
cy: Diweddaru postiad

source: discussion
cy: trafodaeth

source: answered question
cy: Cwestiwn wedi'i ateb

source: unanswered question
cy: cwestiwn heb ei ateb

source: Pinned
cy: Nodwyd

source: Following
cy: Yn dilyn

source: Community TA
cy: CD cymunedol

source: {unread_comments_count} new
cy: {unread_comments_count} newydd

source: Editing response
cy: Golygu ymateb

source: Update response
cy: Diweddaru ymateb

source: marked as answer %(time_ago)s by %(user)s
cy: marciwyd fel ateb %(time_ago) gan %(user)

source: marked as answer %(time_ago)s
cy: marciwyd fel ateb %(time_ago)

source: endorsed %(time_ago)s by %(user)s
cy: cadarnhawyd %(time_ago)s gan %(user)s

source: endorsed %(time_ago)s
cy: cadarnhawyd %(time_ago)s

source: Add a comment
cy: Ychwanegu sylw

source: discussion posted %(time_ago)s by %(author)s
cy: postiwyd %(time_ago) yn ôl gan %(author)

source: question posted %(time_ago)s by %(author)s
cy: postiwyd %(time_ago) yn ôl gan %(author)

source: Closed
cy: Wedi'i gau

source: Related to: %(courseware_title_linked)s
cy: Yn ymwneud â: %(courseware_title_linked)s

source: This post is visible only to %(group_name)s.
cy: Caiff y postiad hwn ei weld gan %(group_name)s yn unig.

source: This post is visible to everyone.
cy: Caiff y postiad hwn ei weld gan bawb.

source: Post type
cy: Y math o bostiad

source: Questions raise issues that need answers. Discussions share ideas and start conversations. (Required)
cy: Mae cwestiynau'n codi materion sy'n galw am atebion. Mae trafodaethau yn rhannu syniadau ac yn dechrau sgyrsiau. (Gofynnol)

source: Question
cy: Cwestiwn

source: Discussion
cy: Trafodaeth

source: Add a Response
cy: Ychwanegu ymateb

source: Add a response:
cy: Ychwanegu ymateb:

source: Topic area
cy: Maes pwnc

source: Add your post to a relevant topic to help others find it. (Required)
cy: Ychwanegwch eich postiad i bwnc perthnasol i helpu eraill i ddod o hyd iddo. (Gofynnol)

source: Discussion Home
cy: Hafan trafodaeth

source: How to use %(platform_name)s discussions
cy: Sut i ddefnyddio trafodaethau %(platform_name)

source: Find discussions
cy: Canfod trafodaethau

source: Use the All Topics menu to find specific topics.
cy: Defnyddiwch y ddewislen Pob pwnc i ganfod pynciau penodol.

source: Search all posts
cy: Chwilio pob postiad

source: Filter and sort topics
cy: Hidlo a threfnu pynciau

source: Engage with posts
cy: Ymwneud â phostiadau

source: Vote for good posts and responses
cy: Pleidleisio am bostiadau ac ymatebion da

source: Report abuse, topics, and responses
cy: Adrodd am gamddefnydd, pynciau ac ymatebion

source: Follow or unfollow posts
cy: Dilyn neu orffen dilyn postiadau

source: Receive updates
cy: Derbyn diweddariadau

source: Toggle Notifications Setting
cy: Gosodiad toglo hysbysiadau

source: Check this box to receive an email digest once a day notifying you about new, unread activity from posts you are following.
cy: Cliciwch y blwch i dderbyn e-bost crynhoad unwaith y dydd yn eich hysbysu am weithgareddau newydd, heb eu darllen o bostiadau rydych yn eu dilyn.

source: All Posts
cy: Pob postiad

source: username or email
cy: enw ddefnyddiwr neu e-bost

source: course id
cy: rhif adnabod y cwrs

source: No results
cy: Dim canlyniadau

source: Course Key
cy: Allwedd y cwrs

source: Download URL
cy: Lawrlwytho URL

source: Grade
cy: Gradd

source: Last Updated
cy: Diweddarwyd ddiwethaf

source: Download the user's certificate
cy: Lawrlwytho tystysgrif y defnyddiwr

source: Not available
cy: Nid yw ar gael

source: Regenerate
cy: Ail-greu

source: Regenerate the user's certificate
cy: Ail-greu tystysgrif y defnyddiwr

source: Generate
cy: Cynhyrchu

source: Generate the user's certificate
cy: Cynhyrchu tystysgrif y defnyddiwr

source: Current enrollment mode:
cy: Modd cofrestru cyfredol:

source: New enrollment mode:
cy: Modd cofrestru newydd:

source: Reason for change:
cy: Y rheswm dros newid:

source: Choose One
cy: Dewiswch un

source: Explain if other.
cy: Eglurwch os arall.

source: Submit enrollment change
cy: Cyflwyno newid cofrestru

source: Username or email address
cy: Enw ddefnyddiwr neu e-bost

source: Course ID
cy: Rhif adnabod y cwrs

source: Course Start
cy: Dechrau'r cwrs

source: Course End
cy: Diwedd y cwrs

source: Upgrade Deadline
cy: Dyddiad cau uwchraddio

source: Verification Deadline
cy: Dyddiad cau gwirio

source: Enrollment Date
cy: Dyddiad cofrestru

source: Enrollment Mode
cy: Modd cofrestru

source: Verified mode price
cy: Pris modd wedi’i wirio

source: Reason
cy: Rheswm

source: Last modified by
cy: Addaswyd ddiwethaf gan

source: N/A
cy: Ddim yn berthnasol

source: Change Enrollment
cy: Newid cofrestru

source: Your team could not be created.
cy: Ni ellid creu eich tîm.

source: Your team could not be updated.
cy: Ni ellid diweddaru eich tîm.

source: Enter information to describe your team. You cannot change these details after you create the team.
cy: Rhowch wybodaeth i ddisgrifio eich tîm. Ni fedrwch newid y manylion hyn wedi i chi greu'r tîm.

source: Optional Characteristics
cy: Nodweddion dewisol

source: Help other learners decide whether to join your team by specifying some characteristics for your team. Choose carefully, because fewer people might be interested in joining your team if it seems too restrictive.
cy: Helpwch ddysgwyr eraill i benderfynu a ddylent ymuno â'ch tîm drwy nodi rhai o nodweddion eich tîm. Dewiswch yn ofalus, am ei bod yn bosib y bydd gan lai o bobl ddiddordeb mewn ymuno â'ch tîm os yw'n ymddangos yn rhy gyfyngol.

source: Create team.
cy: Creu tîm.

source: Update team.
cy: Diweddaru tîm.

source: Cancel team creating.
cy: Canslo creu tîm.

source: Cancel team updating.
cy: Canslo thîm.

source: Instructor tools
cy: Offer hyfforddwr

source: Delete Team
cy: Dileu'r tîm

source: Edit Membership
cy: Golygu aelodaeth

source: Are you having trouble finding a team to join?
cy: Ydych chi'n cael trafferth dod o hyd i dîm i ymuno ag ef?

source: Join Team
cy: Ymuno â thîm

source: Team Details
cy: Manylion y tîm

source: You are a member of this team.
cy: Rydych yn aelod o'r tîm hwn.

source: Team member profiles
cy: Proffiliau aelodau'r tîm

source: Team capacity
cy: Y lle sydd ar y tîm

source: Leave Team
cy: Gadael y tîm

source: Donate
cy: Rhoddi

source: There was an error retrieving preview results for this catalog. Please check that your query is correct and try again.
cy: Cafwyd gwall yn adfer canlyniadau rhagolwg ar gyfer y catalog hwn. Gwiriwch bod eich ymholiad yn gywir a rhoi cynnig arall arni.

source: This catalog's courses:
cy: Cyrsiau'r catalog hwn:

source: Expand All
cy: Ehangu'r cyfan

source: Collapse All
cy: Cwympo'r cyfan

source: Unit
cy: Uned

source: Start Date
cy: Dyddiad dechrau

source: Due Date
cy: Dyddiad dychwelyd

source: remove all
cy: dileu'r cyfan

source: toggle chapter %(displayName)s
cy: toglo pennod %(displayName)s

source: Section
cy: Adran

source: Remove chapter %(chapterDisplayName)s
cy: Dileu pennod %(chapterDisplayName)s

source: remove
cy: dileu

source: toggle subsection %(displayName)s
cy: toglo is-adran %(displayName)s

source: Subsection
cy: Is-adran

source: Remove subsection %(subsectionDisplayName)s
cy: Dileu is-adran %(subsectionDisplayName)s

source: Remove unit %(unitName)s
cy: Dileu uned %(unitName)

source: You still need to visit the %(display_name)s website to complete the credit process.
cy: Mae angen i chi fynd i wefan %(display_name) i gwblhau proses y credydau.

source: To finalize course credit, %(display_name)s requires %(platform_name)s learners to submit a credit request.
cy: I orffen credyd cwrs, mae %(display_name) yn gofyn i ddysgwyr %(platform_name) gyflwyno cais am gredyd.

source: Get Credit
cy: Cael credyd

source: Thank you %(full_name)s! We have received your payment for %(course_name)s.
cy: Diolch %(full_name)s! Rydym wedi derbyn eich taliad ar gyfer %(course_name).

source: Please print this page for your records; it serves as your receipt. You will also receive an email with the same information.
cy: Argraffwch y dudalen hon ar gyfer eich cofnodion; hwn fydd eich derbynneb. Byddwch hefyd yn derbyn e-bost gyda'r un wybodaeth.

source: Order No.
cy: Rhif yr archeb

source: Amount
cy: Swm

source: Total
cy: Cyfanswm

source: Please Note
cy: Sylwer

source: Crossed out items have been refunded.
cy: Mae'r eitemau wedi'u croesi allan wedi cael eu had-dalu.

source: Billed to
cy: Bilio

source: No receipt available
cy: Dim derbynneb ar gael

source: Go to Dashboard
cy: Ewch i'r dangosfwrdd

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from {platformName} to verify your identity.
cy: Os na wiriwch chi pwy ydych chi nawr, gallwch barhau i archwilio'ch cwrs o'ch dangosfwrdd. Byddwch yn derbyn nodiadau atgoffa o bryd i'w gilydd gan {platformName} i wirio pwy ydych chi.

source: Want to confirm your identity later?
cy: Am gadarnhau pwy ydych chi nes ymlaen?

source: Verify Now
cy: Gwirio nawr

source: Mark Exam As Completed
cy: Nodwch yr arholiad wedi'i gwblhau

source: timed
cy: amserwyd

source: To receive credit for problems, you must select "Submit" for each problem before you select "End My Exam".
cy: I dderbyn credyd am broblemau, rhaid i chi ddewis "Cyflwyno" ar gyfer pob problem cyn i chi ddewis "Gorffen fy arholiad".

source: End My Exam
cy: Gorffen fy arholiad

source: LEARN MORE
cy: DYSGU MWY

source: Starts: %(start_date)s
cy: Dechrau: %(start_date)s

source: Starts
cy: Dechrau

source: Clear All
cy: Clirio'r cyfan

source: Highlighted text
cy: Testun a amlygwyd

source: Note
cy: Sylwer

source: You commented...
cy: Gwnaethoch y sylw...

source: Noted in:
cy: Nodwyd yn:

source: Last Edited:
cy: Golygwyd ddiwethaf:

source: Clear search results
cy: Clirio canlyniadau'r chwilio

source: Click to edit
cy: Clicio i olygu

source: Order Number
cy: Rhif y cwrs

source: Date Placed
cy: Dyddiad ychwanegwyd

source: Order Details
cy: Manylion yr archeb

source: for
cy: neu

source: Product Name
cy: Enw'r hyfforddwr

source: Financial Assistance Application
cy: Cymhwysiad Cymorth Ariannol

source: About You
cy: Amdanoch chi

source: The following information is already a part of your {platform} profile. We\'ve included it here for your application.
cy: Mae'r wybodaeth a ganlyn eisoes yn rhan o'ch proffil {platform}. Rydym\ wedi'i gynnwys yma ar gyfer eich cymhwysiad.

source: Email address
cy: Cyfeiriad e-bost

source: Legal name
cy: Enw cyfreithiol

source: Country of residence
cy: Gwlad breswylio

source: Back to {platform} FAQs
cy: Yn ôl i {platform} cwestiynau cyffredin

source: Submit Application
cy: Cyflwyno cais

source: Thank you for submitting your financial assistance application for {course_name}! You can expect a response in 2-4 business days.
cy: Diolch am gyflwyno eich cais am gymorth ariannol ar gyfer {course_name}! Gallwch ddisgwyl ymateb mewn 2-4 diwrnod busnes.

source: Bulk Exceptions
cy: Eithriadau swmp

source: Upload a comma separated values (.csv) file that contains the usernames or email addresses of learners who have been given exceptions. Include the username or email address in the first comma separated field. You can include an optional note describing the reason for the exception in the second comma separated field.
cy: Llwythwch ffeil (.csv) gwerthoedd wedi'u gwahanu gan atalnodau sy'n cynnwys enwau defnyddiwr neu gyfeiriadau e-bost dysgwyr sydd wedi cael eithriadau. Cynhwyswch enw defnyddiwr neu gyfeiriad e-bost yn y maes cyntaf a wahenir gan goma. Gallwch gynnwys nodyn dewisol yn disgrifio'r rheswm dros yr eithrio yn yr ail faes a wahenir gan atalnod.

source: Upload a CSV file
cy: Llwytho ffeil CSV i fyny

source: Add to Exception List
cy: Ychwanegu i'r rhestr eithrio

source: To invalidate a certificate for a particular learner, add the username or email address below.
cy: I annilysu tystysgrif ar gyfer dysgwr penodol, ychwanegwch yr enw defnyddiwr neu gyfeiriad e-bost isod.

source: Add notes about this learner
cy: Ychwanegu nodiadau am y dysgwr hwn

source: Invalidate Certificate
cy: Annilysu'r dystysgrif

source: Student
cy: Myfyriwr

source: Invalidated By
cy: Annilyswyd gan

source: Invalidated
cy: Annilyswyd

source: Notes
cy: Nodiadau

source: Remove from Invalidation Table
cy: Dileu o'r rhestr annilysu

source: Individual Exceptions
cy: Eithriadau unigol

source: Enter the username or email address of each learner that you want to add as an exception.
cy: Rhowch enw defnyddiwr neu gyfeiriad e-bost pob dysgwr rydych am ei ychwanegu fel eithriad.

source: Student email or username
cy: E-bost neu enw defnyddiwr y myfyriwr

source: Free text notes
cy: Nodiadau testun am ddim

source: Generate Exception Certificates
cy: Cynhyrchu tystysgrif eithrio

source: All users on the Exception list who do not yet have a certificate
cy: Pob defnyddiwr ar y rhestr eithrio sydd hyd yma heb dystysgrif

source: All users on the Exception list
cy: Pob defnyddiwr ar y rhestr eithrio

source: User Email
cy: E-bost defnyddiwr

source: Exception Granted
cy: Rhoddwyd eithriad

source: Certificate Generated
cy: Cynhyrchwyd y dystysgrif

source: Remove from List
cy: Dileu o'r rhestr

source: Specify whether discussion topics are divided by cohort
cy: Nodwch a yw pynciau trafod yn cael eu dyrannu gan gohortau

source: Course-Wide Discussion Topics
cy: Pynciau trafod ar draws y cwrs

source: Select the course-wide discussion topics that you want to divide by cohort.
cy: Dewiswch y pynciau trafod cwrs cyfan rydych am eu dyrannu fesul cohort.

source: Content-Specific Discussion Topics
cy: Pynciau trafodaeth cynnwys penodol

source: Specify whether content-specific discussion topics are divided by cohort.
cy: Nodwch a yw pynciau trafod cynnwys penodol yn cael eu dyrannu gan gohortau.

source: Always cohort content-specific discussion topics
cy: Pynciau trafodaeth cynnwys penodol y cohort bob tro

source: Cohort selected content-specific discussion topics
cy: Pynciau trafodaeth cynnwys penodol a ddetholwyd gan y cohort

source: No content-specific discussion topics exist.
cy: Nid oes pynciau trafodaeth cynnwys penodol yn bodoli.

source: Cohorted
cy: Mewn cohortau

source: Manage Students
cy: Rheoli myfyrwyr

source: Add students to this cohort
cy: Ychwanegu myfyrwyr i'r cohort hwn

source: Note: Students can be in only one cohort. Adding students to this group overrides any previous group assignment.
cy: Sylwer: Gall myfyrwyr ond bod mewn un cohort. Mae ychwanegu myfyrwyr i'r grŵp hwn yn diystyru unrhyw aseiniad i grŵp arall.

source: Enter email addresses and/or usernames, separated by new lines or commas, for the students you want to add.
cy: Rhowch gyfeiriadau e-bost a/neu enwau defnyddiwr wedi'u gwahanu gan linellau newydd neu atalnod ar gyfer y myfyrwyr rydych am eu hychwanegu.

source: (Required Field)
cy: (Maes gofynnol)

source: e.g. johndoe@example.com, JaneDoe, joeydoe@example.com
cy: e.e. johndoe@enghraifft.com, JaneDoe, joeydoe@enghraifft.com

source: You will not receive notification for emails that bounce, so double-check your spelling.
cy: Ni dderbyniwch hysbysiad os bydd e-bostiau'n bownsio, felly gwiriwch eich sillafu.

source: Add Students
cy: Ychwanegu myfyrwyr

source: Add a New Cohort
cy: Ychwanegu cohort newydd

source: Enter the name of the cohort
cy: Rhowch enw'r cohort

source: Cohort Name
cy: Enw'r cohort

source: Cohort Assignment Method
cy: Dull aseinio cohort

source: Automatic
cy: Awtomataidd

source: Manual
cy: Â llaw

source: There must be one cohort to which students can automatically be assigned.
cy: Mae'n rhaid bod un cohort y gellir rhoi myfyrwyr ynddo yn awtomatig.

source: Associated Content Group
cy: Grŵp cynnwys cysylltiedig

source: No Content Group
cy: Dim grŵp cynnwys

source: Select a Content Group
cy: Dewis grŵp cynnwys

source: Choose a content group to associate
cy: Dewis grŵp cynnwys i gysylltu

source: Not selected
cy: Heb ddethol

source: Deleted Content Group
cy: Grŵp cynnwys wedi'i ddileu

source: {screen_reader_start}Warning:{screen_reader_end} The previously selected content group was deleted. Select another content group.
cy: {screen_reader_start}Rhybudd:{screen_reader_end} Cafodd y grŵp cynnwys a ddewiswyd yn flaenorol ei ddileu. Dewis grŵp cynnwys arall.

source: {screen_reader_start}Warning:{screen_reader_end} No content groups exist.
cy: {screen_reader_start}Rhybudd:{screen_reader_end} Dim grwpiau cynnwys yn bodoli.

source: Only the parent course staff of a CCX can create content groups.
cy: Staff cwrs rhiant CCX yn unig gaiff greu grwpiau cynnwys.

source: Create a content group
cy: Creu grŵp cynnwys

source: Learners are added to this cohort only when you provide their email addresses or usernames on this page.
cy: Ychwanegir dysgwyr i'r cohort pan fyddwch yn darparu eu cyfeiriadau e-bost neu enau defnyddiwr ar y dudalen hon.

source: What does this mean?
cy: Beth mae hyn yn ei olygu?

source: Learners are added to this cohort automatically.
cy: Ychwanegir dysgwyr i'r cohort yn awtomatig.

source: Select a cohort
cy: Dewis cohort

source: Enable Cohorts
cy: Galluogi cohortau
