Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: Supported
cy: Cefnogir

source: Provisional
cy: Dros dro

source: Not Supported
cy: Heb ei gefnogi

source: Fully Supported
cy: Gyda chefnogaeth lawn

source: Provisionally Supported
cy: Cefnogir dros dro

source: Add New Component
cy: Ychwanegu cydran newydd

source: Deprecated
cy: Anghymeradwy

source: List of uploaded files and assets in this course
cy: Rhestr o ffeiliau ac asedau a lwythwyd i fyny ar y cwrs hwn

source: - Sortable
cy: - Gellir eu trefnu

source: Show All
cy: Dangos y cyfan

source: Other
cy: Arall

source: You haven't added any assets to this course yet.
cy: Nid ydych wedi ychwanegu unrhyw asedau i'r cwrs hwn eto.

source: Upload your first asset
cy: Llwytho eich ased cyntaf i fyny

source: close
cy: cau

source: No description available
cy: Nid oes disgrifiad ar gael

source: Open/download this file
cy: Agor/lawrlwytho'r ffeil hon

source: Web:
cy: Y we:

source: Delete this asset
cy: Dileu'r ased hwn

source: Lock this asset
cy: Cloi'r ased hwn

source: Lock/unlock file
cy: Cloi/datgloi'r ffeil

source: ID
cy: Rhif adnabod

source: Certificate Details
cy: Manylion y dystysgrif

source: Course Title
cy: Teitl y cwrs

source: Course Title Override
cy: Diystyru teitl y cwrs

source: Course Number
cy: Rhif y cwrs

source: Course Number Override
cy: Diystyru rhif y cwrs

source: Certificate Signatories
cy: Llofnodwyr y dystysgrif

source: It is strongly recommended that you include four or fewer signatories. If you include additional signatories, preview the certificate in Print View to ensure the certificate will print correctly on one page.
cy: Argymhellir yn gryf eich bod yn cynnwys pedwar llofnodwr neu lai. Os ydych yn cynnwys llofnodwyr ychwanegol, agorwch rhagolwg o'r dystysgrif yng Ngwedd Argraffu i sicrhau bod y dystysgrif yn argraffu'n gywir ar y dudalen.

source: Certificate Information
cy: Gwybodaeth y dystysgrif

source: Certificate Name
cy: Enw'r dystysgrif

source: Name of the certificate
cy: Enw'r dystysgrif

source: Description of the certificate
cy: Disgrifiad o'r tystysgrif

source: Course title
cy: Teitl y cwrs

source: Specify an alternative to the official course title to display on certificates. Leave blank to use the official course title.
cy: Nodwch ddewis amgen i'r teitl cwrs swyddogol i'w arddangos ar dystysgrifau. Gadewch yn wag i ddefnyddio teitl swyddogol y cwrs.

source: Add Additional Signatory
cy: Ychwanegu llofnodwr ychwanegol

source: (Add signatories for a certificate)
cy: (Ychwanegu llofnodwyr ar gyfer tystysgrif)

source: Choose mode
cy: Dewiswch fodd

source: Preview Certificate
cy: Rhagweld tystysgrif

source: Activate
cy: Ysgogi

source: Deactivate
cy: Dad-ysgogi

source: Caution: The last published version of this unit is live. By publishing changes you will change the student experience.
cy: Rhybudd: Mae'r fersiwn a gyhoeddwyd ddiwethaf yn yr uned hon yn fyw. Trwy gyhoeddi newidiadau byddwch yn newid profiad y myfyriwr.

source: Content Group Name
cy: Enw'r grŵp cynnwys

source: Content Group ID
cy: Rhif adnabod y grŵp cynnwys

source: This is the name of the group
cy: Dyma enw'r grŵp

source: This content group is used in one or more units.
cy: Defnyddir y grŵp cynnwys hwn mewn un neu fwy o unedau.

source: Cannot delete when in use by a unit
cy: Ni ellir ei ddileu pan fod uned yn ei ddefnyddio

source: Subsection Visibility
cy: Gwelededd yr is-adran

source: Show entire subsection
cy: Dangos is-adran gyfan

source: Learners see the published subsection and can access its content.
cy: Gall y dysgwyr weld yr is-adran a gyhoeddwyd a chael at ei gynnwys.

source: Hide content after course end date
cy: Cuddio'r cynnwys ar ôl dyddiad diwedd y cwrs

source: Hide content after due date
cy: Cuddio cynnwys wedi'r dyddiad dychwelyd

source: After the course\'s end date has passed, learners can no longer access subsection content. The subsection remains included in grade calculations.
cy: Wedi i ddyddiad gorffen y cwrs\' fod, ni all y dysgwyr bellach weld cynnwys yr is-adran. Mae'r is-adran yn parhau i gael ei chynnwys wrth gyfrifo graddau.

source: After the subsection\'s due date has passed, learners can no longer access its content. The subsection remains included in grade calculations.
cy: Wedi i ddyddiad dychwelyd yr is-adran\' fod, ni all y dysgwyr bellach weld ei gynnwys. Mae'r is-adran yn parhau i gael ei chynnwys wrth gyfrifo graddau.

source: Hide entire subsection
cy: Cuddio is-adran gyfan

source: Learners do not see the subsection in the course outline. The subsection is not included in grade calculations.
cy: Nid yw'r dysgwyr yn gweld yr is-adran yn amlinelliad y cwrs. Ni chaiff yr is-adran ei chynnwys wrth gyfrifo graddau.

source: If you select an option other than "%(hide_label)s", published units in this subsection become available to learners unless they are explicitly hidden.
cy: Os byddwch yn dewis opsiwn arall heblaw am "%(hide_label)s", bydd yr unedau cyhoeddedig yn yr is-adran hon y dod ar gael i ddysgwyr oni bai eu bod wedi'u cuddio'n fwriadol.

source: Instructor Name
cy: Enw'r hyfforddwr

source: Please add the instructor's name
cy: Ychwanegwch enw'r hyfforddwr

source: Instructor Title
cy: Teitl yr hyfforddwr

source: Please add the instructor's title
cy: Ychwanegwch deitl yr hyfforddwr

source: Organization
cy: Sefydliad

source: Organization Name
cy: Enw'r sefydliad

source: Please add the institute where the instructor is associated
cy: Ychwanegwch y sefydliad mae'r hyfforddwr yn gysylltiedig ag ef

source: Biography
cy: Bywgraffiad

source: Instructor Biography
cy: Bywgraffiad yr hyfforddwr

source: Please add the instructor's biography
cy: Ychwanegwch fywgraffiad yr hyfforddwr

source: Photo
cy: Llun

source: Instructor Photo
cy: Llun o'r hyfforddwr

source: Instructor Photo URL
cy: URL llun o'r hyfforddwr

source: Please add a photo of the instructor (Note: only JPEG or PNG format supported)
cy: Ychwanegwch lun o'r hyfforddwr (Sylwer: cefnogir fformat JPEG neu PNG yn unig)

source: Upload Photo
cy: Llwytho llun i fyny

source: Prerequisite: %(prereq_display_name)s
cy: Hanfodol: %(prereq_display_name)s

source: Contains staff only content
cy: Yn cynnwys cynnwys staff yn unig

source: Unpublished changes to live content
cy: Newidiadau i gynnwys byw heb eu cyhoeddi

source: Unpublished units will not be released
cy: Ni chaiff unedau heb eu cyhoeddi eu rhyddhau

source: Unpublished changes to content that will release in the future
cy: Newidiadau heb eu cyhoeddi i gynnwys a gaiff ei ryddhau yn y dyfodol

source: Some content in this unit is visible only to specific groups of learners
cy: Mae peth cynnwys yr uned hon yn weladwy i grwpiau cynnwys penodol yn unig

source: Ungraded
cy: Heb raddio

source: Practice proctored Exam
cy: Ymarfer arholiad procter

source: Proctored Exam
cy: Arholiad procter

source: Collapse/Expand this %(xblock_type)s
cy: Cwympo/Ehangu'r %(xblock_type) hwn

source: Display Name
cy: Enw a ddangosir

source: Configure
cy: Ffurfweddu

source: Duplicate
cy: Copi dyblyg

source: Drag to reorder
cy: Llusgwch i aildrefnu

source: Release Status:
cy: Statws y rhyddhau:

source: Released:
cy: Rhyddhawyd:

source: Scheduled:
cy: Amserlennwyd:

source: Graded as:
cy: Graddiwyd fel:

source: Due:
cy: Dyddiad dychwelyd:

source: Subsection is hidden after course end date
cy: Caiff yr is-adran ei chuddio ar ôl dyddiad diwedd y cwrs

source: Subsection is hidden after due date
cy: Caiff yr is-adran ei chuddio ar ôl dyddiad dychwelyd y cwrs

source: You haven't added any content to this course yet.
cy: Nid ydych wedi ychwanegu unrhyw gynnwys i'r cwrs hwn eto.

source: Click to add a new %(xblock_type)s
cy: Cliciwch i ychwanegu %(xblock_type) newydd

source: Learning Outcome
cy: Canlyniad dysgu

source: Add a learning outcome here
cy: Ychwanegu canlyniad dysgu yma

source: Assignment Type Name
cy: Enw'r math o aseiniad

source: The general category for this type of assignment, for example, Homework or Midterm Exam. This name is visible to learners.
cy: Y categori cyffredinol ar gyfer y math hwn o aseiniad, er enghraifft, gwaith cartref neu arholiad ganol tymor. Mae'r enw hwn yn weladwy i ddysgwyr.

source: Abbreviation
cy: Byrfodd

source: This short name for the assignment type (for example, HW or Midterm) appears next to assignments on a learner's Progress page.
cy: Mae'r enw byr hwn ar gyfer y math o aseiniad (er enghraifft, GC neu Canoltym) yn ymddangos nesaf at aseiniadau ar dudalen cynnydd y dysgwyr.

source: Weight of Total Grade
cy: Pwysoliad y Cyfanswm Gradd

source: The weight of all assignments of this type as a percentage of the total grade, for example, 40. Do not include the percent symbol.
cy: Mae pwysoliad yr holl aseiniadau o'r math hwn fel canran o'r cyfanswm gradd, er enghraifft, yn 40. Peidiwch â chynnwys yr arwydd canran.

source: Total Number
cy: Cyfanswm nifer

source: The number of subsections in the course that contain problems of this assignment type.
cy: Nifer yr is-adrannau yn y cwrs sy'n cynnwys problemau o'r math hwn.

source: Number of Droppable
cy: Nifer y gellir eu gollwng

source: The number of assignments of this type that will be dropped. The lowest scoring assignments are dropped first.
cy: Bydd nifer yr aseiniadau o'r math hwn a fydd yn cael eu gollwng. Caiff yr aseiniadau sy'n sgorio leiaf eu gollwng yn gyntaf.

source: Course Handouts
cy: Taflenni'r cwrs

source: You have no handouts defined
cy: Nid ydych wedi diffinio unrhyw daflenni

source: There is invalid code in your content. Please check to make sure it is valid HTML.
cy: Mae côd annilys yn eich cynnwys. Gwiriwch i wneud yn siŵr ei fod yn HTML dilys.

source: Send push notification to mobile apps
cy: Anfonwch hysbysiad gwthio i app symudol

source: Send notification to mobile apps
cy: Anfonwch hysbysiad i app symudol

source: Post
cy: Postio

source: Due Date:
cy: Dyddiad dychwelyd:

source: Due Time in UTC:
cy: Amser dychwelyd yn UTC:

source: Clear Grading Due Date
cy: Clirio dyddiad dychwelyd graddio

source: Chapter Name
cy: Enw'r bennod

source: Chapter {order}
cy: {order} Pennod

source: provide the title/name of the chapter that will be used in navigating
cy: rhowch deitl/enw'r bennod a ddefnyddiwr wrth lywio

source: Chapter Asset
cy: Ased y bennod

source: upload a PDF file or provide the path to a Studio asset file
cy: llwythwch ffeil PDF i fyny neu ddarparu llwybr i ffeil ased Studio

source: Upload PDF
cy: Llwytho PDF i fyny

source: delete chapter
cy: dileu pennod

source: Textbook information
cy: Gwybodaeth am y werslyfr

source: Textbook Name
cy: Enw'r werslyfr

source: Introduction to Cookie Baking
cy: Cyflwyniad i bobi bisgedi

source: provide the title/name of the text book as you would like your students to see it
cy: rhowch deitl/enw'r werslyfr fel yr hoffech i'ch myfyrwyr ei weld

source: Chapter information
cy: Gwybodaeth am y bennod

source: Add a Chapter
cy: Ychwanegu pennod

source: Grading
cy: Graddio

source: Grade as:
cy: Graddio fel:

source: Not Graded
cy: Heb raddio

source: Cannot delete when in use by an experiment
cy: Ni ellir ei ddileu pan fod arbrawf yn ei ddefnyddio

source: This Group Configuration is used in:
cy: Caiff y ffurfweddiad grŵp hwn ei ddefnyddio yn:

source: This Group Configuration is not in use. Start by adding a content experiment to any Unit via the {linkStart}Course Outline{linkEnd}.
cy: Nid yw'r ffurfweddiad grŵp hwn yn cael ei ddefnyddio. Ddechreuwch drwy ychwanegu arbrawf cynnwys i unrhyw uned drwy {linkStart}Amlinelliad y Cwrs{linkEnd}.

source: Group Configuration information
cy: Gwybodaeth am ffurfweddiad y grŵp

source: Group Configuration Name
cy: Enw ffurfweddiad y grŵp

source: Group Configuration ID
cy: Rhif adnabod ffurfweddiad y grŵp

source: This is the Name of the Group Configuration
cy: Dyma enw ffurfweddiad y grŵp

source: Name or short description of the configuration
cy: Enw neu ddisgrifiad byr o'r ffurfweddu

source: This is the Description of the Group Configuration
cy: Dyma ddisgrifiad o'r Ffurfweddiad Grŵp

source: Optional long description
cy: Disgrifiad hir dewisol

source: Group information
cy: Gwybodaeth am y grŵp

source: Name of the groups that students will be assigned to, for example, Control, Video, Problems. You must have two or more groups.
cy: Enw'r grwpiau y bydd y myfyrwyr yn cael eu haseinio iddynt, er enghraifft, Rheoli, Fideo, Problemau. Mae'n rhaid bod gennych ddau grŵp neu fwy.

source: Add another group
cy: Ychwanegu grŵp arall

source: This configuration is currently used in content experiments. If you make changes to the groups, you may need to edit those experiments.
cy: Mae'r ffurfweddiad hwn yn cael ei ddefnyddio ar hyn o bryd mewn arbrofion cynnwys. Os gwnewch newidiadau i'r grwpiau, mae'n bosib y bydd angen i chi olygu'r arbrofion hynny.

source: delete group
cy: dileu grŵp

source: License Type
cy: Math o drwydded

source: Learn more about {license_name}
cy: Dysgu mwy am {license_name}

source: Options for {license_name}
cy: Dewisiadau ar gyfer {license_name}

source: The following options are available for the {license_name} license.
cy: Mae'r dewisiadau hyn ar gael ar gyfer y drwydded {license_name}.

source: License Display
cy: Arddangos trwydded

source: The following message will be displayed at the bottom of the courseware pages within your course:
cy: Bydd y neges hon yn cael ei harddangos ar waelod tudalennau deunydd cwrs eich cwrs:

source: Creative Commons licensed content, with terms as follow:
cy: Cynnwys trwyddedig Creative Commons, gyda thelerau fel a ganlyn:

source: Some Rights Reserved
cy: Cedwir peth hawliau

source: New %(item_type)s
cy: %(item_type)s newydd

source: Add
cy: Ychwanegu

source: Clear Value
cy: Clirio'r gwerth

source: Component Location ID
cy: Rhif adnabod lleoliad cydran

source: Download
cy: Lawrlwytho

source: Current location
cy: Sgwrs gyfredol

source: View child items
cy: Gweld cwrs a archifwyd

source: Currently selected
cy: Heb ddethol

source: You haven't added any textbooks to this course yet.
cy: Nid ydych wedi ychwanegu unrhyw werslyfrau i'r cwrs hwn eto.

source: Add your first textbook
cy: Ychwanegwch eich gwerslyfr cyntaf

source: Use this group to control a component's visibility in the {linkStart}Course Outline{linkEnd}.
cy: Nid yw'r grŵp cynnwys hwn yn cael ei ddefnyddio. Ychwanegu grŵp cynnwys i unrhyw uned o {linkStart}Amlinelliad y Cwrs{linkEnd}.

source: Previous Uploads
cy: Ffeiliau a lwythwyd i fyny o'r blaen

source: Download available encodings (.csv)
cy: Lawrlwytho'r amgodiadau (.csv) sydd ar gael

source: Duration
cy: Hyd

source: Video ID
cy: Rhif adnabod fideo

source: Remove this video
cy: Dileu'r fideo hwn

source: Remove {video_name} video
cy: Dileu fideo {video_name}

source: Never published
cy: Erioed wedi'i gyhoeddi

source: Last published %(last_published_date)s by %(publish_username)s
cy: Cyhoeddwyd ddiwethaf %(last_published_date) gan %(publish_username)

source: Previously published
cy: Cyhoeddwyd o'r blaen

source: Draft (Never published)
cy: Drafft (erioed wedi'i gyhoeddi)

source: Visible to Staff Only
cy: Yn weladwy i staff yn unig

source: Published and Live
cy: Wedi'u cyhoeddi ac yn fyw

source: Published (not yet released)
cy: Cyhoeddwyd (heb ei ryddhau eto)

source: Draft (Unpublished changes)
cy: Drafft (newidiadau heb eu cyhoeddi)

source: Release:
cy: Rhyddhau:

source: Publishing Status
cy: Statws cyhoeddi

source: with %(release_date_from)s
cy: gyda %(release_date_from)s

source: Is Visible To:
cy: Yn weladwy i:

source: Will Be Visible To:
cy: Bydd yn weladwy i:

source: Staff Only
cy: Staff yn unig

source: with %(section_or_subsection)s
cy: gyda %(section_or_subsection)s

source: Staff and Learners
cy: Staff a dysgwyr

source: Some content in this unit is visible only to specific groups of learners.
cy: Mae peth cynnwys yr uned hon yn weladwy i grwpiau cynnwys penodol yn unig

source: Hide from learners
cy: Cuddio rhag y dysgwyr

source: Note: Do not hide graded assignments after they have been released.
cy: Sylwer: Peidiwch â chuddio aseiniadau wedi'u graddio wedi iddynt gael eu rhyddhau.

source: Release Date and Time
cy: Dyddiad ac amser rhyddhau:

source: Release Date:
cy: Dyddiad rhyddhau:

source: Release Time in UTC:
cy: Amser rhyddhau yn UTC:

source: Clear Release Date/Time
cy: Clirio dyddiad/amser rhyddhau

source: View Live
cy: Gweld yn fyw

source: Signatory
cy: Llofnodwr

source: Signature Image
cy: Delwedd llofnod

source: Certificate Signatory Configuration
cy: Ffurfweddiad llofnodwyr y dystysgrif

source: Name
cy: Enw

source: Name of the signatory
cy: Enw'r llofnodwr

source: The name of this signatory as it should appear on certificates.
cy: Enw'r llofnodwr fel y dylai ymddangos ar dystysgrifau.

source: Title
cy: Teitl

source: Title of the signatory
cy: Teitl y sawl sy'n llofnodi

source: Titles more than 100 characters may prevent students from printing their certificate on a single page.
cy: Gall teitlau mwy na 100 nod/cymeriad atal myfyrwyr rhag argraffu eu tystysgrif ar ddalen sengl.

source: Organization
cy: Sefydliad

source: Organization of the signatory
cy: Sefydliad y llofnodwr

source: The organization that this signatory belongs to, as it should appear on certificates.
cy: Y sefydliad y mae'r llofnodwr hwn yn perthyn iddo, fel y dylai ymddangos ar dystysgrifau.

source: Path to Signature Image
cy: Llwybr i'r ddelwedd llofnod

source: Image must be in PNG format
cy: Rhaid i'r ddelwedd fod ar ffurf PNG

source: Upload Signature Image
cy: Llwytho delwedd llofnod i fyny

source: Unit Visibility
cy: Gwelededd yr uned

source: Section Visibility
cy: Gwelededd yr is-adran

source: If the unit was previously published and released to learners, any changes you made to the unit when it was hidden will now be visible to learners.
cy: Os oedd yr uned wedi'i chyhoeddi a'i rhyddhau i ddysgwyr o'r blaen, bydd unrhyw newidiadau a wnaethoch i'r uned pan yn gudd bellach yn weladwy i'r dysgwyr.

source: If you make this %(xblockType)s visible to learners, learners will be able to see its content after the release date has passed and you have published the unit. Only units that are explicitly hidden from learners will remain hidden after you clear this option for the %(xblockType)s.
cy: Os byddwch yn gwneud y %(xblockType) hwn yn weladwy i ddysgwyr, dylai'r dysgwyr allu gweld ei gynnwys wedi i'r dyddiad rhyddhau fod a'ch bod wedi cyhoeddi'r uned. Unedau a gaiff eu cuddio'n benodol oddi wrth dysgwyr yn unig a fydd yn parhau'n gudd oni bai eich bod yn clirio'r opsiwn hwn ar gyfer %(xblockType)s.

source: Current Role:
cy: Rôl gyfredol:

source: You!
cy: Chi!

source: send an email message to {email}
cy: anfon neges e-bost at {email}

source: Promote another member to Admin to remove your admin rights
cy: Dyrchafu aelod arall i Weinyddol i ddileu eich hawliau gweinyddu

source: Add {role} Access
cy: Ychwanegu mynediad {role}

source: Remove {role} Access
cy: Dileu mynediad {role}

source: Delete the user, {username}
cy: Dileu'r defnyddiwr, {username}

source: Set as a Special Exam
cy: Sefydlu arholiad arbennig

source: Exam Types
cy: Mathau o arholiadau

source: Timed
cy: Amserwyd

source: Use a timed exam to limit the time learners can spend on problems in this subsection. Learners must submit answers before the time expires. You can allow additional time for individual learners through the Instructor Dashboard.
cy: Defnyddiwch arholiad a amserir i gyfyngu'r amser gall ddysgwyr ei dreulio ar broblemau yn yr is-adran hon. Rhaid i'r dysgwyr gyflwyno atebion cyn i'r amser ddod i ben. Gallwch ganiatáu amser ychwanegol ar gyfer dysgwyr unigol drwy Ddangosfwrdd yr Hyfforddwr.

source: Proctored
cy: Procter

source: Proctored exams are timed and they record video of each learner taking the exam. The videos are then reviewed to ensure that learners follow all examination rules.
cy: Mae arholiadau procter wedi'u hamseru ac yn recordio fideo o bob dysgwr wrth gymryd yr arholiad. Yna caiff y fideos eu hadolygu i sicrhau bod y dysgwyr yn dilyn holl reolau'r arholiad.

source: Practice Proctored
cy: Arholiad procter ymarfer

source: Use a practice proctored exam to introduce learners to the proctoring tools and processes. Results of a practice exam do not affect a learner's grade.
cy: Defnyddiwch arholiad procter ymarfer i gyflwyno dysgwyr i'r offer a'r prosesau proctora. Ni wnaeth canlyniadau'r arholiad ymarfer effeithio ar radd y dysgwr.

source: Time Allotted (HH:MM):
cy: Amser a roddir (AA:MM):

source: Select a time allotment for the exam. If it is over 24 hours, type in the amount of time. You can grant individual learners extra time to complete the exam through the Instructor Dashboard.
cy: Dewis faint o amser i'w roi i'r arholiad. Os yw dros 24 awr, rhowch faint o amser. Gallwch roi mwy o amser i ddysgwyr unigol i gwblhau'r arholiad drwy Ddangosfwrdd yr hyfforddwr.

source: Review Rules
cy: Adolygu'r rheolau

source: Specify any additional rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed.
cy: Nodwch unrhyw reolau ychwanegol neu eithriadau i'r rheolau y dylai'r tîm proctora eu gorfodi wrth adolygu'r fideos. Er enghraifft, gallech nodi y caniateir defnyddio cyfrifiannell.

source: File upload succeeded
cy: Llwyddwyd i lwytho'r ffeil i fyny

source: Please check the following validation feedbacks and reflect them in your course settings:
cy: Gwiriwch yr adborth gwirio hyn a myfyrio arnynt yn eich gosodiadau cwrs:

source: Verification Checkpoint
cy: Man gwirio

source: Must complete verification checkpoint
cy: Rhaid i chi gwblhau man gwirio

source: Verification checkpoint to be completed
cy: Man gwirio i'w gwblhau

source: Learners who require verification must pass the selected checkpoint to see the content in this unit. Learners who do not require verification see this content by default.
cy: Rhaid i'r dysgwyr y mae angen gwiriad arnynt basio'r pwynt gwirio a ddetholwyd i weld cynnwys yr uned hon. Mae dysgwyr nad oes angen gwiriad arnynt yn gweld y cynnwys hwn yn ddiofyn.

source: Edit the name
cy: Golygu'r enw

source: Edit %(display_name)s (required)
cy: Golygu %(display_name)s (gofynnol)

source: You have done a dry run of force publishing the course. Nothing has changed. Had you run it, the following course versions would have been change.
cy: Rydych wedi ymarfer gorfodi cyhoeddi'r cwrs. Dim byd wedi newid. Petaech wedi'i redeg, byddai'r fersiynau hyn o'r cwrs wedi cael eu newid.

source: The published branch version, {published}, was reset to the draft branch version, {draft}.
cy: Cafodd y fersiwn cangen gyhoeddedig, {published}, ei hailosod i'r fersiwn cangen ddrafft, {draft}.

source: Add URLs for additional versions
cy: Ychwanegu UL ar gyfer fersiynau ychwanegol

source: To be sure all students can access the video, we recommend providing both an .mp4 and a .webm version of your video. Click below to add a URL for another version. These URLs cannot be YouTube URLs. The first listed video that's compatible with the student's computer will play.
cy: I sicrhau bod yr holl fyfyrwyr yn cael mynediad i'r fideo, rydym yn argymell darparu fersiynau .mp4 a .webm eich fideo. Cliciwch isod i ychwanegu URL ar gyfer fersiwn arall. Ni chaiff yr URL fod yn URL YouTube. Bydd y fideo a restrir gyntaf sy'n gydnaws â chyfrifiadur y myfyriwr yn chwarae.

source: Default Timed Transcript
cy: Trawsgrifiad a amserwyd diofyn

source: Timed Transcript Conflict
cy: Gwrthdaro trawsgrifiad a amserwyd

source: The timed transcript for the first video file does not appear to be the same as the timed transcript for the second video file.
cy: Nid yw'r trawsgrifiad a amserwyd ar gyfer y fideo cyntaf yn ymddangos yr un un â'r trawsgrifiad a amserwyd ar gyfer yr ail fideo.
