Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: These users were successfully added as beta testers:
cy: Cafodd y defnyddwyr hyn eu hychwanegu fel profwyr beta yn llwyddiannus:

source: These users were successfully removed as beta testers:
cy: Cafodd y defnyddwyr hyn eu dileu fel profwyr beta yn llwyddiannus:

source: These users were not added as beta testers:
cy: Ni chafodd y defnyddwyr hyn eu hychwanegu fel profwyr beta:

source: These users were not removed as beta testers:
cy: Ni chafodd y defnyddwyr hyn eu dileu fel profwyr beta:

source: Users must create and activate their account before they can be promoted to beta tester.
cy: Rhaid i ddefnyddwyr greu ac ysgogi eu cyfrifon cyn cael eu dyrchafu i fod yn brofwr beta.

source: Could not find users associated with the following identifiers:
cy: Ni fedrwyd dod o hyd i ddefnyddwyr cysylltiedig â'r dynodyddion hyn:

source: Reason field should not be left blank.
cy: Ni ddylai'r maes rheswm fod yn wag.

source: Error enrolling/unenrolling users.
cy: Gwall wrth gofrestru/dadgofrestru defnyddwyr.

source: The following email addresses and/or usernames are invalid:
cy: Mae'r cyfeiriadau e-bost a/neu'r enwau defnyddiwr hyn yn annilys:

source: Successfully enrolled and sent email to the following users:
cy: Cofrestrwyd yn llwyddiannus ac anfonwyd neges e-bost cofrestru at y defnyddwyr hyn:

source: Successfully enrolled the following users:
cy: Cofrestrwyd y defnyddwyr hyn yn llwyddiannus:

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
cy: Anfonwyd negeseuon e-bost cofrestru yn llwyddiannus at y defnyddwyr hyn Byddant yn cael ymgofrestru ar ôl cofrestru:

source: These users will be allowed to enroll once they register:
cy: Bydd y defnyddwyr hyn yn cael ymgofrestru ar ôl cofrestru:

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
cy: Anfonwyd negeseuon e-bost cofrestru yn llwyddiannus at y defnyddwyr hyn Byddant yn ymgofrestru ar ôl cofrestru:

source: These users will be enrolled once they register:
cy: Bydd y defnyddwyr hyn yn ymgofrestru ar ôl cofrestru:

source: Emails successfully sent. The following users are no longer enrolled in the course:
cy: Anfonwyd y negeseuon e-bost yn llwyddiannus. Nid yw'r defnyddwyr hyn bellach wedi'u cofrestru ar y cwrs:

source: The following users are no longer enrolled in the course:
cy: Nid yw'r defnyddwyr hyn bellach wedi'u cofrestru ar y cwrs:

source: These users were not affiliated with the course so could not be unenrolled:
cy: Ni chafodd y defnyddwyr hyn eu cysylltu â'r cwrs felly ni fedrwyd dadgofrestru:

source: Your message must have a subject.
cy: Rhaid i'ch neges gael pwnc.

source: Your message cannot be blank.
cy: Ni chaiff eich neges fod yn wag.

source: Your message must have at least one target.
cy: Rhaid bod gennych o leiaf un targed.

source: There are invalid keywords in your email. Check the following keywords and try again.
cy: Mae allweddeiriau annilys yn eich e-bost. Gwiriwch yr allweddeiriau hyn a rhoi cynnig arall arni.

source: Yourself
cy: Eich hun

source: Everyone who has staff privileges in this course
cy: Pawb sydd â breintiau staff ar gyfer y cwrs hwn.

source: All learners who are enrolled in this course
cy: Pob dysgwr sydd wedi cofrestru ar y cwrs hwn

source: All learners in the {cohort_name} cohort
cy: Pob dysgwr yn y cohort {cohort_name}

source: All learners in the {track_name} track
cy: Pob dysgwyr ar y trac {track_name}

source: Your email message was successfully queued for sending. In courses with a large number of learners, email messages to learners might take up to an hour to be sent.
cy: Cafodd eich neges e-bost ei roi yn llwyddiannus mewn ciw i'w anfon. Mewn cyrsiau gyda niferoedd mawr o ddysgwyr, gall negeseuon e-bost at ddysgwyr gymryd hyd at awr i'w hanfon.

source: You are sending an email message with the subject {subject} to the following recipients.
cy: Rydych yn anfon neges e-bost gyda'r pwnc {subject} at y bobl hyn.

source: Is this OK?
cy: Ydy hyn yn OK?

source: Error sending email.
cy: Gwall wrth anfon e-bost.

source: There is no email history for this course.
cy: Nid oes hanes e-bost ar gyfer y cwrs hwn.

source: There was an error obtaining email task history for this course.
cy: Cafwyd gwall wrth geisio hanes tasgau e-bostiau ar gyfer y cwrs hwn.

source: There was an error obtaining email content history for this course.
cy: Cafwyd gwall wrth geisio hanes cynnwys e-bostiau ar gyfer y cwrs hwn.

source: Send to:
cy: Anfon at:

source: Please enter a student email address or username.
cy: Rhowch gyfeiriad e-bost neu enw defnyddiwr myfyriwr.

source: Error getting student progress url for '<%- student_id %>'. Make sure that the student identifier is spelled correctly.
cy: Gwall wrth gyrchu url cynnydd myfyriwr ar gyfer '<%- student_id %>'. Sicrhewch bod dynodydd y myfyriwr wedi'i sillafu'n gywir.

source: Please enter a problem location.
cy: Rhowch leoliad y broblem.

source: Success! Problem attempts reset for problem '<%- problem_id %>' and student '<%- student_id %>'.
cy: Llwyddiant! Ailosodwyd y ceisiadau problem ar gyfer problem '<%- problem_id %>' a myfyriwr '<%- student_id %>'.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
cy: Gwall wrth ailosod ceisiadau problem ar gyfer problem '<%= problem_id %>' a myfyriwr '<%- student_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Delete student '<%- student_id %>'s state on problem '<%- problem_id %>'?
cy: Dileu cyflwr myfyriwr '<%- student_id %> ar broblem '<%- problem_id %>'?

source: Error deleting student '<%- student_id %>'s state on problem '<%- problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
cy: Gwall wrth ddileu cyflwr myfyriwr '<%- student_id %> ar broblem '<%- problem_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Module state successfully deleted.
cy: Dilëwyd cyflwr modiwl yn llwyddiannus.

source: Error getting task history for problem '<%- problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
cy: Gwall wrth gyrchu hanes tasg ar gyfer problem '<%- problem_id %>' a myfyriwr '<%- student_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Entrance exam attempts is being reset for student '{student_id}'.
cy: Mae nifer ceisiadau arholiad mynediad yn cael ei ailosod ar gyfer myfyriwr '{student_id}'.

source: Error resetting entrance exam attempts for student '{student_id}'. Make sure student identifier is correct.
cy: Gwall wrth ailosod ceisiadau arholiad mynediad ar gyfer myfyriwr '{student_id}'. Sicrhewch bod y dynodydd myfyriwr yn gywir.

source: Enter a student's username or email address.
cy: Rhowch enw defnyddiwr neu gyfeiriad e-bost myfyriwr.

source: Do you want to allow this student ('{student_id}') to skip the entrance exam?
cy: Ydych chi am ganiatáu i'r myfyriwr hwn ('{student_id}') beidio â gwneud yr arholiad mynediad?

source: An error occurred. Make sure that the student's username or email address is correct and try again.
cy: Gwall wedi digwydd. Sicrhewch bod enw defnyddiwr a chyfeiriad e-bost y myfyriwr yn gywir a cheisio eto.

source: Entrance exam state is being deleted for student '{student_id}'.
cy: Mae cyflwr arholiad yn cael ei ddileu ar gyfer myfyriwr '{student_id}'.

source: Error deleting entrance exam state for student '{student_id}'. Make sure student identifier is correct.
cy: Gwall wrth ddileu cyflwr arholiad mynediad ar gyfer myfyriwr '{student_id}'. Sicrhewch bod y dynodydd myfyriwr yn gywir.

source: Error getting entrance exam task history for student '{student_id}'. Make sure student identifier is correct.
cy: Gwall wrth gyrchu hanes tasg arholiad mynediad ar gyfer myfyriwr '{student_id}'. Sicrhewch bod y dynodydd myfyriwr yn gywir.

source: Reset attempts for all students on problem '<%- problem_id %>'?
cy: Ail-osod ceisiadau ar gyfer pob myfyriwr ar gyfer problem '<%- problem_id %>'?

source: Successfully started task to reset attempts for problem '<%- problem_id %>'. Click the 'Show Task Status' button to see the status of the task.
cy: Dechreuwyd tasg i ailosod ceisiadau ar gyfer y broblem yn llwyddiannus '<%- problem_id %>'. Cliciwch y botwm 'Dangos Statws Tasg' i weld statws y dasg.

source: Error starting a task to reset attempts for all students on problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
cy: Gwall wrth ddechrau tasg i ail-osod ceisiadau ar gyfer yr holl fyfyrwyr ar gyfer problem '<%- problem_id %>'. Sicrhewch bod dynodydd y broblem yn gyflawn ac yn gywir.

source: Error listing task history for this student and problem.
cy: Gwall wrth restru hanes tasg ar gyfer y myfyriwr hwn a'r broblem hon.

source: Started rescore problem task for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
cy: Dechreuwyd ail-sgorio tasg broblem ar gyfer problem '<%- problem_id %>' a myfyriwr '<%- student_id %>'. Cliciwch y botwm 'Dangos Statws Tasg' i weld statws y dasg.

source: Error starting a task to rescore problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
cy: Gwall wrth ddechrau tasg i ail-sgorio problem '<%- problem_id %>' ar gyfer myfyriwr '<%- student_id %>'. Sicrhewch bod dynodwyr y broblem a'r myfyrwyr yn gyflawn ac yn gywir.

source: Started entrance exam rescore task for student '{student_id}'. Click the 'Show Task Status' button to see the status of the task.
cy: Dechrau tasg ailfarcio arholiad mynediad ar gyfer myfyriwr '{student_id}'. Cliciwch y botwm 'Dangos Statws Tasg' i weld statws y dasg.

source: Error starting a task to rescore entrance exam for student '{student_id}'. Make sure that entrance exam has problems in it and student identifier is correct.
cy: Gwall wrth ddechrau tasg i ail-sgorio arholiad mynediad ar gyfer myfyriwr '{student_id}'. Sicrhewch fod gan yr arholiad mynediad broblemau ynddo a bod y dynodydd myfyriwr yn gywir.

source: Rescore problem '<%- problem_id %>' for all students?
cy: Ail-sgorio problem '<%- problem_id %>' ar gyfer pob myfyriwr?

source: Successfully started task to rescore problem '<%- problem_id %>' for all students. Click the 'Show Task Status' button to see the status of the task.
cy: Dechreuwyd tasg i ail-sgorio problem '<%- problem_id %>' yn llwyddiannus. Cliciwch y botwm 'Dangos Statws Tasg' i weld statws y dasg.

source: Error starting a task to rescore problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
cy: Gwall wrth ddechrau tasg i ail-sgorio problem '<%- problem_id %>'. Sicrhewch bod dynodydd y broblem yn gyflawn ac yn gywir.

source: Task Type
cy: Y math o dasg

source: Task inputs
cy: Mewnbynnau tasg

source: Task ID
cy: Rhif adnabod y dasg

source: Requester
cy: Ceisydd

source: Submitted
cy: Cyflwynwyd

source: Duration (sec)
cy: Hyd (eiliadau)

source: State
cy: Cyflwr

source: Task Status
cy: Statws y dasg

source: Task Progress
cy: Cynnydd y dasg

source: An error occurred retrieving your email. Please try again later, and contact technical support if the problem persists.
cy: Cafwyd gwall wrth nôl eich e-bost. Rhowch gynnig arall arni nes ymlaen, a chysylltu â chefnogaeth dechnegol os yw'r broblem yn parhau.

source: Subject
cy: Pwnc

source: Sent By
cy: Anfonwyd gan

source: Sent To
cy: Anfonwyd at

source: Time Sent
cy: Amser anfonwyd

source: Number Sent
cy: Nifer a anfonwyd

source: Copy Email To Editor
cy: Copïo e-bost i'r golygydd

source: Subject:
cy: Pwnc:

source: Sent By:
cy: Anfonwyd gan:

source: Time Sent:
cy: Amser anfonwyd:

source: Sent To:
cy: Anfonwyd at:

source: Message:
cy: Neges:

source: No tasks currently running.
cy: Nid oes tasg yn rhedeg ar hyn o bryd.

source: File Name
cy: Enw'r ffeil

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
cy: Caiff dolenni eu cynhyrchu ar gais a byddant yn darfod o fewn 5 munud oherwydd natur sensitif gwybodaeth myfyrwyr.

source: {type} Progress
cy: Ar waith

source: Earned Certificates
cy: Tystysgrif wedi'i gwirio

source: Enrolled
cy: Cofrestrwyd

source: %s result
cy: %s canlyniadau

source: Unknown Error Occurred.
cy: Gwall anhysbys wedi digwydd.

source: Successfully reset the attempts for user {user}
cy: Ailosodwyd y ceisiadau ar gyfer defnyddiwr {user} yn llwyddiannus

source: Failed to reset attempts for user.
cy: Methwyd ail-osod ceisiadau ar gyfer defnyddiwr.

source: Successfully deleted student state for user {user}
cy: Dilëwyd cyflwr myfyriwr ar gyfer defnyddiwr {user} yn llwyddiannus

source: Failed to delete student state for user.
cy: Methwyd dileu cyflwr myfyriwr ar gyfer defnyddiwr.

source: Successfully rescored problem for user {user}
cy: Ail-sgoriwyd problem ar gyfer defnyddiwr {user} yn llwyddiannus

source: Failed to rescore problem for user.
cy: Methwyd ail-sgorio problem ar gyfer defnyddiwr.

source: Successfully rescored problem to improve score for user {user}
cy: Ail-sgoriwyd problem i wella sgôr ar gyfer defnyddiwr {user} yn llwyddiannus

source: Failed to rescore problem to improve score for user.
cy: Methwyd ail-sgorio problem i wella sgôr ar gyfer defnyddiwr.

source: The data could not be saved.
cy: Nid oeddem yn gallu cadw'r data.

source: Please enter a valid email address
cy: Rhowch gyfeiriad e-bost dilys

source: Please enter a valid password
cy: Rhowch gyfrinair dilys

source: Password reset email sent. Follow the link in the email to change your password.
cy: Anfonwyd e-bost ailosod cyfrinair. Dilynwch y ddolen yn yr e-bost i newid eich cyfrinair.

source: We weren't able to send you a password reset email.
cy: Nid oeddem yn gallu anfon e-bost ailosod cyfrinair atoch.

source: Please check your email to confirm the change
cy: Gwiriwch eich e-bost i gadarnhau'r newid

source: Saving your email preference
cy: Cadw eich dewis e-bost

source: Enrolling you in the selected course
cy: Yn eich cofrestru ar y cwrs a ddetholwyd

source: Adding the selected course to your cart
cy: Yn ychwanegu'r cwrs a ddewiswyd i'ch troli

source: Loading your courses
cy: Yn llwytho eich cyrsiau

source: An error occurred.
cy: Gwall wedi digwydd.

source: We couldn't sign you in.
cy: Nid oeddem yn gallu eich mewngofnodi.

source: An error occurred when signing you in to %s.
cy: Cafwyd gwall wrth eich mewngofnodi i %s

source: Check Your Email
cy: Edrychwch yn eich e-bost

source: {paragraphStart}You entered {boldStart}{email}{boldEnd}. If this email address is associated with your {platform_name} account, we will send a message with password reset instructions to this email address.{paragraphEnd}{paragraphStart}If you do not receive a password reset message, verify that you entered the correct email address, or check your spam folder.{paragraphEnd}{paragraphStart}If you need further assistance, {anchorStart}contact technical support{anchorEnd}.{paragraphEnd}
cy: {paragraphStart}Rhoesoch {boldStart}{email}{boldEnd}. Os yw'r cyfeiriad e-bost hwn yn gysylltiedig â'ch cyfrif {platform_name}, byddwn yn anfon neges gyda chyfarwyddiadau ailosod cyfrinair i'r cyfeiriad e-bost hwn.{paragraphEnd}

source: An error has occurred. Try refreshing the page, or check your Internet connection.
cy: Gwall wedi digwydd. Ceisiwch Ail-wneud y dudalen, neu wirio eich cysylltiad Rhyngrwyd.

source: You have successfully signed into %(currentProvider)s, but your %(currentProvider)s account does not have a linked %(platformName)s account. To link your accounts, sign in now using your %(platformName)s password.
cy: Rydych wedi mewngofnodi'n llwyddiannus i %(currentProvider), ond eich %(currentProvider)s

source: We couldn't create your account.
cy: Nid oeddem yn gallu creu eich cyfrif.

source: You've successfully signed into %(currentProvider)s.
cy: Rydych wedi mewngofnodi'n llwyddiannus i %(currentProvider)s.

source: We just need a little more information before you start learning with %(platformName)s.
cy: Mae angen ychydig mwy o wybodaeth arnom cyn i chi ddechrau dysgu gyda %(platformName)s.

source: Basic Account Information
cy: Gwybodaeth cyfrif sylfaenol

source: These settings include basic information about your account. You can also specify additional information and see your linked social accounts on this page.
cy: Mae'r gosodiadau hyn yn cynnwys gwybodaeth sylfaenol am eich cyfrif. Gallwch hefyd nodi gwybodaeth ychwanegol a gweld eich cyfrifon cymdeithasol cysylltiedig ar y dudalen hon.

source: The name that identifies you throughout {platform_name}. You cannot change your username.
cy: Yr enw sy'n eich dynodi trwy gydol {platform_name}. Nid ydych yn gallu newid eich enw defnyddiwr.

source: Full Name
cy: Enw llawn

source: The name that is used for ID verification and appears on your certificates. Other learners never see your full name. Make sure to enter your name exactly as it appears on your government-issued photo ID, including any non-Roman characters.
cy: Yr enw a ddefnyddir ar gyfer gwirio pwy ydych chi ac sy'n ymddangos ar eich tystysgrifau. Ni fydd y dysgwyr eraill yn gweld eich enw llawn. Sicrhewch eich bod yn rhoi eich enw'n union fel y mae'n ymddangos ar eich cerdyn adnabod llun a ddyroddwyd gan lywodraeth, gan gynnwys unrhyw nodau/gymeriadau nad ydynt yn Rufeinig.

source: Email Address
cy: Cyfeiriad e-bost

source: The email address you use to sign in. Communications from {platform_name} and your courses are sent to this address.
cy: Y cyfeiriad e-bost a ddefnyddiwch i fewngofnodi. Caiff cyfathrebiadau o {platform_name} a'ch cyrsiau eu hanfon i'r cyfeiriad hwn.

source: Password
cy: Cyfrinair

source: Reset Your Password
cy: Ail-osod wich cyfrinair

source: When you select "Reset Your Password", a message will be sent to the email address for your {platform_name} account. Click the link in the message to reset your password.
cy: Pan fyddwch yn dewis "Ailosod eich cyfrinair", bydd neges yn cael ei hanfon i'r cyfeiriad e-bost ar gyfer eich cyfrif {platform_name}. Cliciwch ar y ddolen yn y neges i ailosod eich cyfrinair.

source: The language used throughout this site. This site is currently available in a limited number of languages.
cy: Yr iaith a ddefnyddiwyd trwy gydol y safle hwn. Mae'r safle hwn ar gael ar hyn o bryd mewn nifer cyfyngedig o ieithoedd.

source: Country or Region
cy: Gwlad neu ranbarth

source: Time Zone
cy: Cylchfa amser

source: Select the time zone for displaying course dates. If you do not specify a time zone, course dates, including assignment deadlines, will be displayed in your browser's local time zone.
cy: Dewiswch y gylchfa amser ar gyfer arddangos dyddiadau'r cwrs. Os na fyddwch yn nodi cylchfa amser bydd dyddiadau cwrs, gan gynnwys dyddiadau cau aseiniadau, yn ymddangos yng nghylchfa amser leol eich porwr.

source: All Time Zones
cy: Pob cylchfa amser

source: Default (Local Time Zone)
cy: Diofyn (cylchfa amser leol)

source: Additional Information
cy: Gwybodaeth gyffredinol

source: Education Completed
cy: Addysg wedi'i chwblhau

source: Gender
cy: Rhyw

source: Year of Birth
cy: Blwyddyn geni

source: Preferred Language
cy: Eich dewis iaith

source: Linked Accounts
cy: Cyfrifon cysylltiedig

source: You can link your social media accounts to simplify signing in to {platform_name}.
cy: Gallwch gysylltu eich cyfrifon cyfryngau cymdeithasol i symleiddio mewngofnodi i {platform_name}.

source: ORDER NAME
cy: ENW'R ARCHEB

source: ORDER PLACED
cy: ARCHEB WEDI'I GOSOD

source: TOTAL
cy: CYFANSWM

source: ORDER NUMBER
cy: RHIF YR ARCHEB

source: My Orders
cy: Fy archebion

source: This page contains information about orders that you have placed with {platform_name}.
cy: Mae'r dudalen hon yn cynnwys gwybodaeth am archebion rydych wedi'u gwneud gyda {platform_name}.

source: We've sent a confirmation message to {new_email_address}. Click the link in the message to update your email address.
cy: Rydym wedi anfon neges gadarnhau at {new_email_address}. Cliciwch ar y ddolen yn y neges i diweddaru eich cyfeiriad e-bost.

source: You must sign out and sign back in before your language changes take effect.
cy: Rhaid i chi allgofnodi a mewngofnodi unwaith eto cyn i'r newid iaith ddod i rym.

source: We've sent a message to {email_address}. Click the link in the message to reset your password.
cy: Rydym wedi anfon neges at {email_address}. Cliciwch ar y ddolen yn y neges i ailosod eich cyfrinair.

source: Link your {accountName} account
cy: Cysylltu eich cyfrif {accountName}

source: Unlink This Account
cy: Datgysylltu'r cyfrif hwn

source: You can use your {accountName} account to sign in to your {platformName} account.
cy: Gallwch ddefnyddio'ch cyfrif {accountName} i fewngofnodi i'ch cyfrif {platformName}.

source: Unlink your {accountName} account
cy: Datgysylltu eich cyfrif {accountName}

source: Link Your Account
cy: Cysylltu eich cyfrif

source: Link your {accountName} account to your {platformName} account and use {accountName} to sign in to {platformName}.
cy: Cysylltwch eich cyfrif {accountName} i'ch cyfrif {platformName} a defnyddio {accountName} i fewngofnodi i {platformName}.

source: Unlinking
cy: Datgysylltu

source: Linking
cy: Cysylltu

source: Successfully unlinked.
cy: Datgysylltu'n llwyddiannus.

source: Account Information
cy: Gwybodaeth am y cyfrif

source: Order History
cy: Cofnod archebu

source: Accomplishments Pagination
cy: Tudaleniad cyflawniadau

source: {platform_name} learners can see my:
cy: Gall dysgwyr {platform_name} weld fy:

source: Limited Profile
cy: Proffil cyfyngedig

source: Full Profile
cy: Proffil llawn

source: Add Country
cy: Ychwanegu gwlad

source: Add language
cy: Ychwanegu iaith

source: About me
cy: Amdanaf i

source: Tell other learners a little about yourself: where you live, what your interests are, why you're taking courses, or what you hope to learn.
cy: Dweud wrth ddysgwyr eraill ychydig amdanoch eich hun: ble rydych yn byw, beth yw eich diddordebau, pam eich bod yn cymryd cyrsiau, neu beth rydych yn gobeithio ei ddysgu.

source: Account Settings page.
cy: Tudalen osodiadau'r cyfrif.

source: You must specify your birth year before you can share your full profile. To specify your birth year, go to the {account_settings_page_link}
cy: Rhaid i chi nodi flwyddyn eich geni cyn eich bod yn cael rhannu proffil llawn. I nodi blwyddyn eich geni, ewch i {account_settings_page_link}

source: You must be over 13 to share a full profile. If you are over 13, make sure that you have specified a birth year on the {account_settings_page_link}
cy: Rhaid i chi fod dros 13 i rannu proffil llawn. Os ydych dros 13, sicrhewch eich bod wedi nodi blwyddyn eni yn{account_settings_page_link}

source: Profile Image
cy: Delwedd proffil

source: Profile image for {username}
cy: Delwedd proffil ar gyfer {username}

source: About Me
cy: Amdanaf i

source: Accomplishments
cy: Cyflawniadau

source: Profile
cy: Proffil

source: Image Upload Error
cy: Gwall llwytho delwedd i fyny

source: Please verify that you have uploaded a valid image (PNG and JPEG).
cy: Gwiriwch eich bod wedi llwytho delwedd ddilys i fyny (PNG a JPEG).

source: An error has occurred. Please try again later.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni nes ymlaen.

source: Could not submit photos
cy: Yn methu cyflwyno llun

source: Professional Education Verified Certificate
cy: Tystysgrif addysg broffesiynol wedi'i gwirio

source: Professional Education
cy: Addysg broffesiynol

source: Verified Certificate upgrade
cy: Uwchraddio tystysgrif wedi'i gwirio
