Repository: proversity-org/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: cy

source: Verified Certificate
cy: Tystysgrif wedi'i gwirio

source: Checkout
cy: Talu

source: Checkout with PayPal
cy: Talu gyda PayPal

source: Checkout with {processor}
cy: Talu gyda {processor}

source: All payment options are currently unavailable.
cy: Nid yw'r holl ddewisiadau talu ar gael ar hyn o bryd.

source: Try the transaction again in a few minutes.
cy: Rhowch gynnig arall ar y trafodyn mewn ychydig funudau.

source: An error has occurred. Please try again.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni.

source: Could not submit order
cy: Yn methu cyflwyno'r archeb

source: Could not retrieve payment information
cy: Ni ellid adfer gwybodaeth am y taliad

source: Take a photo of your ID
cy: Tynnwch lun o'ch cerdyn adnabod

source: Review your info
cy: Adolygu eich gwybodaeth

source: An error has occurred. Please try reloading the page.
cy: Gwall wedi digwydd. Ceisiwch ail-lwytho'r dudalen.

source: Video Capture Error
cy: Gwall cipio fideo

source: Please verify that your webcam is connected and that you have allowed your browser to access it.
cy: Gwiriwch bod eich gwe-gamera yn gysylltiedig a'ch bod wedi caniatáu mynediad iddo i'ch porwr.

source: No Webcam Detected
cy: Ni chanfuwyd gwe-gamera

source: You don't seem to have a webcam connected.
cy: Ymddengys nad oes gennych gwe-gamera wedi'i gysylltu.

source: Double-check that your webcam is connected and working to continue.
cy: Ailwiriwch bod eich gwe-gamera wedi'i gysylltu ac yn gweithio er mwyn parhau.

source: Photo Captured successfully.
cy: Cipiwyd y llun yn llwyddiannus.

source: No Flash Detected
cy: Ni ellid dod o hyd i Flash

source: You don't seem to have Flash installed. Get Flash to continue your verification.
cy: Ymddengys nad ydych wedi gosod Fflach. Cael Flash er mwyn parhau eich gwiriad.

source: Editable
cy: Gellir ei olygu

source: Validation Error
cy: Gwall dilysu

source: In Progress
cy: Ar waith

source: Placeholder
cy: Dalfan

source: Your upload of '{file}' succeeded.
cy: Llwyddwyd i lwytho eich '{file}' i fyny.

source: Your upload of '{file}' failed.
cy: Methwyd llwytho eich '{file}' i fyny.

source: Upload an image
cy: Llwytho delwedd i fyny

source: Change image
cy: Newid y ddelwedd

source: An error has occurred. Refresh the page, and then try again.
cy: Gwall wedi digwydd. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: The file must be at least {size} in size.
cy: Rhaid i'r ffeil fod o leiaf {size} mewn maint.

source: The file must be smaller than {size} in size.
cy: Rhaid i'r ffeil fod yn llai na {size} mewn maint.

source: Upload is in progress. To avoid errors, stay on this page until the process is complete.
cy: Llwytho i fyny ar waith. I osgoi gwallau, arhoswch ar y dudalen hon hyd nes bod y broses yn gyflawn.

source: Removal is in progress. To avoid errors, stay on this page until the process is complete.
cy: Dileu ar waith I osgoi gwallau, arhoswch ar y dudalen hon hyd nes bod y broses yn gyflawn.

source: bytes
cy: beitiau

source: Course is not yet visible to students.
cy: Nid yw'r cwrs eto yn weladwy i'r myfyrwyr.

source: You cannot view the course as a student or beta tester before the course release date.
cy: Ni allwch weld y cwrs fel myfyriwr neu brofwr beta cyn dyddiad rhyddhau'r cwrs.

source: Number of Students
cy: Nifer y myfyrwyr

source: Overall Score
cy: Sgôr gyffredinol

source: This may be happening because of an error with our server or your internet connection. Try refreshing the page or making sure you are online.
cy: Gall fod hyn yn digwydd oherwydd bod gwall ar ein gweinyddion neu eich cysylltiad rhyngrwyd. Ceisiwch Ail-wneud y dudalen neu wneud yn siŵr eich bod ar-lein.

source: Studio's having trouble saving your work
cy: Mae Studio yn cael trafferth cadw eich gwaith

source: OpenAssessment Save Error
cy: Agor asesiad Cadw Gwall

source: This link will open in a new browser window/tab
cy: Bydd y ddolen hon yn agor mewn ffenestr/tab porwr newydd

source: This link will open in a modal window
cy: Bydd y ddolen hon yn agor mewn ffenestr moddol

source: Could not parse certificate JSON. %(message)s
cy: Ni ellid dosrannu'r pasport JSON. %(message)s

source: Certificate name is required.
cy: Mae enw'r dystysgrif yn ofynnol.

source: Signatory field(s) has invalid data.
cy: Mae gan y maes (meysydd) llofnodwr ddata annilys.

source: Edit this certificate?
cy: Golygu'r dystysgrif hon?

source: This certificate has already been activated and is live. Are you sure you want to continue editing?
cy: Mae'r dystysgrif hon eisoes wedi cael ei hysgogi ac yn fyw. Ydych chi'n siŵr eich bod am barhau i olygu?

source: Yes, allow edits to the active Certificate
cy: Ie, caniatewch golygu'r dystysgrif actif

source: certificate
cy: tystysgrif

source: Set up your certificate
cy: Sefydlu eich tystysgrif

source: You have not created any certificates yet.
cy: Nid ydych wedi creu unrhyw dystysgrifau eto.

source: Delete "<%= signatoryName %>" from the list of signatories?
cy: Dileu "<%= signatoryName %>" o'r rhestr o lofnodwyr?

source: This action cannot be undone.
cy: Ni ellir dadwneud y weithred hon.

source: Deleting
cy: Yn dileu

source: Upload signature image.
cy: Llwytho delwedd llofnod i fyny.

source: Image must be in PNG format.
cy: Rhaid i'r ddelwedd fod ar ffurf PNG.

source: Group %s
cy: %s y grŵp

source: ABCDEFGHIJKLMNOPQRSTUVWXYZ
cy: ABCChDDdEFFfGNgHIJLLlMNOPPhRRhSTThUWY

source: Your export has failed.
cy: Mae eich mewnforio wedi methu.

source: There was an error while importing the new library to our database.
cy: Cafwyd gwall wrth fewnforio'r llyfrgell newydd i'n cronfa ddata.

source: There was an error while importing the new course to our database.
cy: Cafwyd gwall wrth fewnforio'r cwrs newydd i'n cronfa ddata.

source: There was an error during the upload process.
cy: Cafwyd gwall yn ystod y broses llwytho i fyny.

source: There was an error while unpacking the file.
cy: Cafwyd gwall wrth ddadbacio'r ffeil.

source: There was an error while verifying the file you submitted.
cy: Cafwyd gwall wrth wirio'r ffeil a gyflwynoch.

source: Choose new file
cy: Dewiswch ffeil newydd

source: Your import has failed.
cy: Mae eich mewnforio wedi methu.

source: File format not supported. Please upload a file with a {file_extension} extension.
cy: Ni chefnogir fformat y ffeil. Llwytho ffeil gyda'r estyniad {file_extension} i fyny.

source: Already a course team member
cy: Eisoes yn aelod tîm y cwrs

source: Are you sure you want to delete {email} from the course team for “{container}”?
cy: Ydych chi'n siŵr eich bod am ddileu'r {email} o dîm y cwrs “{container}”?

source: Admin
cy: Gweinyddol

source: Already a library team member
cy: Eisoes yn aelod tîm y llyfrgell

source: Are you sure you want to delete {email} from the library “{container}”?
cy: Ydych chi'n siŵr eich bod am ddileu'r {email} o'r llyfrgell “{container}”?

source: Library User
cy: Defnyddiwr llyfrgell

source: Hide Deprecated Settings
cy: Cuddio'r gosodiadau anghymeradwy

source: Show Deprecated Settings
cy: Dangos gosodiadau anghymeradwy

source: You have unsaved changes. Do you really want to leave this page?
cy: Nid ydych wedi cadw eich newidiadau. Ydych chi wir am adael y dudalen hon?

source: Internal Server Error.
cy: Gwall gweinydd mewnol.

source: Queued
cy: Mewn ciw

source: Upload completed
cy: Llwytho i fyny wedi'i gwblhau

source: Upload failed
cy: Llwytho i fyny wedi methu

source: Chapter name and asset_path are both required
cy: Mae angen enw'r bennod a'r asset_path

source: Chapter name is required
cy: Mae enw'r bennod yn ofynnol

source: asset_path is required
cy: mae angen asset_path

source: You must specify a name
cy: Rhaid i chi nodi enw

source: Action required: Enter a valid date.
cy: Y gweithredu gofynnol: Rhowch ddyddiad dilys.

source: Group name is required
cy: Mae angen enw ar y grŵp

source: Group A
cy: Grŵp A

source: Group B
cy: Grŵp B

source: Group Configuration name is required.
cy: Mae angen enw ar ffurfweddiad y grŵp.

source: There must be at least one group.
cy: Rhaid bod gennych o leiaf un grŵp.

source: All groups must have a name.
cy: Rhaid i bob grŵp gael enw.

source: All groups must have a unique name.
cy: Rhaid i bob grŵp gael enw unigryw.

source: The course must have an assigned start date.
cy: Rhaid rhoi dyddiad dechrau i'r cwrs.

source: The course end date must be later than the course start date.
cy: Rhaid i ddyddiad cau y cwrs fod yn hwyrach na dyddiad dechrau'r cwrs.

source: The course start date must be later than the enrollment start date.
cy: Rhaid i ddyddiad dechrau'r cwrs fod yn hwyrach na dyddiad cofrestru'r cwrs.

source: The enrollment start date cannot be after the enrollment end date.
cy: Ni chaiff ddyddiad dechrau cofrestru'r cwrs fod yn hwyrach na dyddiad cau cofrestru'r cwrs.

source: The enrollment end date cannot be after the course end date.
cy: Ni chaiff ddyddiad cofrestru'r cwrs fod yn hwyrach na dyddiad gorffen y cwrs.

source: Key should only contain letters, numbers, _, or -
cy: Dylai'r allwedd gynnwys llythrennau, rhifau, _, or - yn unig

source: Please enter an integer between %(min)s and %(max)s.
cy: Rhowch gyfanrif rhwng %(min)s a %(max)s.

source: There's already another assignment type with this name.
cy: Mae yna aseiniad arall gyda'r enw hwn eisoes.

source: Please enter an integer between 0 and 100.
cy: Rhowch gyfanrif rhwng 1 a 100.

source: Please enter an integer greater than 0.
cy: Rhowch gyfanrif mwy na 0.

source: Please enter non-negative integer.
cy: Rhowch gyfanrif nad yw'n negyddol.

source: Cannot drop more <%= types %> assignments than are assigned.
cy: Ni ellir gollwng mwy o <%= types %> aseiniadau na ddyroddwyd.

source: Grace period must be specified in HH:MM format.
cy: Rhaid nodi'r cyfnod gras ar fformat AA:MM.

source: Not able to set passing grade to less than %(minimum_grade_cutoff)s%.
cy: Nid oes modd gosod gradd lwyddo lai na %(minimum_grade_cutoff)s%.

source: Textbook name is required
cy: Mae angen enw'r gwerslyfr

source: Please add at least one chapter
cy: Ychwanegwch o leiaf un bennod

source: All chapters must have a name and asset
cy: Rhaid i bob pennod gael enw ac ased

source: Only <%= fileTypes %> files can be uploaded. Please select a file ending in <%= fileExtensions %> to upload.
cy: Ffeiliau <%= fileTypes %> yn unig a gaiff eu llwytho i fyny. Dewiswch ffeil sy'n gorffen â <%= fileExtensions %> i lwytho i fyny.

source: or
cy: neu

source: This component has validation issues.
cy: Mae problemau dilysu gan y gydran hon.

source: Your file could not be uploaded
cy: Nid oeddem yn gallu llwytho eich ffeil i fyny

source: Your video uploads are not complete.
cy: Nid yw eich fideo wedi llwytho i fyny yn gyflawn.

source: Upload completed for video {fileName}
cy: Llwytho i fyny wedi'i gwblhau ar gyfer fideo {fileName}

source: Upload failed for video {fileName}
cy: Llwytho i fyny wedi methu ar gyfer fideo {fileName}

source: {filename} is not in a supported file format. Supported file formats are {supportedFileFormats}.
cy: Nid yw {filename} mewn fformat ffeil a gefnogir.

source: {filename} exceeds maximum size of {maxFileSizeInGB} GB.
cy: Mae {filename} yn fwy na'r mwyafswm maint {maxFileSizeInMBs} GB.

source: : video upload complete.
cy: : llwtho fideo i fyny wedi'i gwblhau.

source: Previous Uploads table has been updated.
cy: Mae'r tabl ffeiliau a lwythwyd i fyny eisoes wedi'i ddiweddaru.

source: Delete File Confirmation
cy: Dileu cadarnhad y ffeil

source: Are you sure you wish to delete this item. It cannot be reversed! Also any content that links/refers to this item will no longer work (e.g. broken images and/or links)
cy: Ydych chi'n siŵr eich bod am ddileu'r eitem hon. Ni ellir ei ddadwneud! Hefyd ni fydd unrhyw gynnwys sy'n cysylltu/cyfeirio at yr eitem hon bellach yn gweithio (e.e. delweddau a/neu ddolenni wedi'u torri)

source: Your file has been deleted.
cy: Mae eich ffeil wedi cael ei ddileu.

source: Date Added
cy: Dyddiad ychwanegwyd

source: Type
cy: Math

source: File {filename} exceeds maximum size of {maxFileSizeInMBs} MB
cy: Mae ffeil {filename} yn fwy na'r mwyafswm maint {maxFileSizeInMBs} MB

source: Please follow the instructions here to upload a file elsewhere and link to it: {maxFileSizeRedirectUrl}
cy: Dilynwch y cyfarwyddiadau yma i lwytho ffeil i fyny i rywle arall a rhoi dolen iddi: {maxFileSizeRedirectUrl}

source: Max file size exceeded
cy: Mae'r ffeil yn rhy fawr

source: Upload New File
cy: Llwytho ffeil newydd i fyny

source: Load Another File
cy: Llwytho ffeil arall

source: Adding
cy: Ychwanegu

source: Are you sure you want to delete this update?
cy: Ydych chi'n siŵr eich bod am ddileu'r diweddariad hwn?

source: Create Re-run
cy: Creu ailredeg

source: Processing Re-run Request
cy: Prosesu'r cais i ailredeg

source: Upload a new PDF to “<%= name %>”
cy: Llwytho PDF newydd i fyny i “<%= name %>”

source: Please select a PDF file to upload.
cy: Dewiswch ffeil PDF i'w llwytho i fyny.

source: There has been an error while exporting.
cy: Cafwyd gwall wrth allforio.

source: There has been a failure to export to XML at least one component. It is recommended that you go to the edit page and repair the error before attempting another export. Please check that all components on the page are valid and do not display any error messages.
cy: Methwyd allforio i XML o leiaf un gydran. Argymhellir eich bod yn mynd i'r dudalen olygu ac yn atgyweirio'r gwall cyn ceisio allforio eto. Gwiriwch fod yr holl gydrannau ar y dudalen yn ddilys ac nad ydynt yn arddangos unrhyw negeseuon gwall.

source: Correct failed component
cy: Cywirwch y gydran a fethodd

source: Return to Export
cy: Dychwelyd i allforio

source: Your library could not be exported to XML. There is not enough information to identify the failed component. Inspect your library to identify any problematic components and try again.
cy: Ni fedrwyd allforio eich llyfrgell i XML. Nid oes digon o wybodaeth i nodi'r gydran ddiffygiol. Archwiliwch eich llyfrgell i nodi unrhyw gydrannau a allai achosi problemau a cheisio eto.

source: Take me to the main library page
cy: Ewch â fi i brif dudalen y llyfrgell

source: Your course could not be exported to XML. There is not enough information to identify the failed component. Inspect your course to identify any problematic components and try again.
cy: Ni fedrwyd allforio eich cwrs i XML. Nid oes digon o wybodaeth i nodi'r gydran ddiffygiol. Archwiliwch eich cwrs i nodi unrhyw gydrannau a allai achosi problemau a cheisio eto.

source: Take me to the main course page
cy: Ewch â fi i brif dudalen y cwrs

source: The raw error message is:
cy: Y neges wall grai yw:

source: There has been an error with your export.
cy: Cafwyd gwall wrth allforio.

source: Contains {count} group
cy: Creu grŵp cynnwys

source: Not in Use
cy: Nid yw'n cael ei ddefnyddio

source: group configuration
cy: cyfluniad y grŵp

source: Add your first group configuration
cy: Ychwanegwch eich ffurfweddiad grŵp cyntaf

source: You have not created any group configurations yet.
cy: Nid ydych wedi creu unrhyw ffurfweddiadau grŵp eto.

source: Your import is in progress; navigating away will abort it.
cy: Mae eich mewnforio ar waith; bydd llywio ymaith yn ei derfynu.

source: Error importing course
cy: Gwall wrth fewnforio cwrs

source: There was an error with the upload
cy: Cafwyd gwall wrth lwytho i fyny

source: Upload instructor image.
cy: Llwytho delwedd hyfforddwr i fyny.

source: Files must be in JPEG or PNG format.
cy: Rhaid i ffeiliau fod ar fformat JPEG neu PNG.

source: All Rights Reserved
cy: Cedwir pob hawl

source: You reserve all rights for your work
cy: Cewch gadw pob hawl am eich gwaith

source: You waive some rights for your work, such that others can use it too
cy: Rydych yn ildio peth hawliau am eich gwaith, fel y gall eraill ei ddefnyddio hefyd

source: Version
cy: Fersiwn

source: Attribution
cy: Priodoliad

source: Allow others to copy, distribute, display and perform your copyrighted work but only if they give credit the way you request. Currently, this option is required.
cy: Caniatáu i eraill gopïo, ddosbarthu, arddangos a pherfformio eich gwaith hawlfreintio, ond os ydynt yn rhoi credyd yn y modd y dymunwch yn unig. Ar hyn o bryd, mae'r dewis hwn yn ofynnol.

source: Noncommercial
cy: Anfasnachol

source: Allow others to copy, distribute, display and perform your work - and derivative works based upon it - but for noncommercial purposes only.
cy: Caniatáu i eraill gopïo, ddosbarthu, arddangos a pherfformio eich gwaith - a gwaith deilliadol yn seiliedig arno - ond at ddibenion anfasnachol yn unig.

source: No Derivatives
cy: Dim deilliad

source: Allow others to copy, distribute, display and perform only verbatim copies of your work, not derivative works based upon it. This option is incompatible with "Share Alike".
cy: Caniatáu i eraill gopïo, ddosbarthu, arddangos a pherfformio copïau air am air o'ch gwaith, nid gwaith deilliadol yn seiliedig arno. Mae'r dewis hwn yn anghydnaws â "Rhannu tebyg".

source: Share Alike
cy: Rhannu tebyg

source: Allow others to distribute derivative works only under a license identical to the license that governs your work. This option is incompatible with "No Derivatives".
cy: Caniatáu i eraill ddosbarthu gwaith deilliadol o dan drwydded yr un union yr un fath â'r drwydded sy'n llywodraethu eich gwaith chi. Mae'r dewis hwn yn anghydnaws â "Dim deilliannau".

source: Delete this %(item_display_name)s?
cy: Dileu %(item_display_name)?

source: Deleting this %(item_display_name)s is permanent and cannot be undone.
cy: Mae dileu %(item_display_name) yn barhaol ac ni ellir ei ddad-wneud.

source: There was an error changing the user's role
cy: Cafwyd gwall wrth newid rôl y defnyddiwr

source: Error adding user
cy: Gwall wrth ychwanegu defnyddiwr

source: Error removing user
cy: Gwall wrth ddileu defnyddiwr

source: A valid email address is required
cy: Mae angen cyfeiriad e-bost dilys

source: You must enter a valid email address in order to add a new team member
cy: Rhaid i chi roi cyfeiriad e-bost dilys er mwyn ychwanegu aelod tîm newydd

source: Return and add email address
cy: Dychwelyd ac ychwanegu cyfeiriad e-bost

source: Already a member
cy: Eisoes yn aelod

source: {email} is already on the {container} team. Recheck the email address if you want to add a new member.
cy: Mae'r {email} eisoes ar y tîm {container}. Ailwiriwch y cyfeiriad e-bost os ydych am ychwanegu aelod newydd.

source: Return to team listing
cy: Dychwelyd i restr y timau

source: Are you sure?
cy: Ydych chi'n siŵr?

source: Are you sure you want to restrict {email} access to “{container}”?
cy: Ydych chi'n siŵr eich bod am gyfyngu mynediad {email} i'r “{container}”?

source: {display_name} Settings
cy: Gosodiadau {display_name}

source: Change the settings for {display_name}
cy: Newid y gosodiadau ar gyfer {display_name}

source: Publish {display_name}
cy: Cyhoeddi {display_name}

source: Publish all unpublished changes for this {item}?
cy: Cyhoeddi'r holl newidiadau na chyhoeddwyd ar gyfer {item}?

source: Publish
cy: Cyhoeddi

source: Basic
cy: Sylfaenol

source: Visibility
cy: Gwelededd yr uned

source: Editing: %(title)s
cy: Golygu: %(title)s

source: Component
cy: Cydran

source: Move: {displayName}
cy: Enw a ddangosir

source: Validation Error While Saving
cy: Gwall dilysu wrth gadw

source: Undo Changes
cy: Dad-wneud newidiadau

source: Change Manually
cy: Newid eich hunan

source: Sections
cy: Adran

source: Subsections
cy: Is-adran

source: Units
cy: Uned

source: Components
cy: Cydran

source: Groups
cy: Grwpiau

source: This {parentCategory} has no {childCategory}
cy: Grwpiau

source: Course Outline
cy: Amlinelliad o'r cwrs

source: Date added
cy: Dyddiad ychwanegwyd

source: Editing visibility for: %(title)s
cy: Golygu gwelededd ar gyfer: %(title)s

source: Publishing
cy: Yn cyhoeddi

source: Discard Changes
cy: Anwybyddu'r newidiadau

source: Are you sure you want to revert to the last published version of the unit? You cannot undo this action.
cy: Ydych chi'n siŵr eich bod am fynd yn ôl i fersiwn gyhoeddedig ddiwethaf yr uned? Ni chewch ddadwneud hyn.

source: Discarding Changes
cy: Yn anwybyddu'r newidiadau

source: Hiding from Students
cy: Cuddio rhag y myfyrwyr

source: Explicitly Hiding from Students
cy: Cuddio'n benodol rhag y myfyrwyr

source: Inheriting Student Visibility
cy: Etifeddu gwelededd myfyriwr

source: Make Visible to Students
cy: Gwneud yn weladwy i fyfyrwyr

source: If the unit was previously published and released to students, any changes you made to the unit when it was hidden will now be visible to students. Do you want to proceed?
cy: Os oedd yr uned wedi'i chyhoeddi a'i rhyddhau i fyfyrwyr o'r blaen, bydd unrhyw newidiadau a wnaethoch i'r uned pan yn gudd bellach yn weladwy i'r myfyrwyr. Ydych chi am fwrw ymlaen?

source: Making Visible to Students
cy: Gwneud yn weladwy i fyfyrwyr

source: Course Index
cy: Mynegai'r cwrs

source: There were errors reindexing course.
cy: Cafwyd gwallau wrth ailfynegeio'r cwrs.

source: Hide Previews
cy: Cuddio'r rhagolygiadau

source: Show Previews
cy: Dangos rhagolygiadau

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} ascending
cy: Yn dangos {currentItemRange} o {totalItemsCount}, hidlwyd yn ôl {assetType}, trefnwyd gan {sortName} o'r dechrau i'r diwedd

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} descending
cy: Yn dangos {currentItemRange} o {totalItemsCount}, hidlwyd yn ôl {assetType}, trefnwyd gan {sortName} o'r diwedd i'r dechrau

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} ascending
cy: Yn dangos {currentItemRange} o {totalItemsCount}, trefnwyd gan {sortName} o'r dechrau i'r diwedd

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} descending
cy: Yn dangos {currentItemRange} o {totalItemsCount}, trefnwyd gan {sortName} o'r diwedd i'r dechrau

source: {totalItems} total
cy: cyfanswm {totalItems}

source: content group
cy: grŵp cynnwys

source: Add your first content group
cy: Ychwanegwch eich grŵp cynnwys cyntaf

source: You have not created any content groups yet.
cy: Nid ydych wedi creu unrhyw grwpiau cynnwys eto.

source: Pending
cy: Yn yr arfaeth

source: Are you sure you want to remove this video from the list?
cy: Ydych chi'n siŵr eich bod am dynnu'r fideo hwn o'r rhestr?

source: Removing a video from this list does not affect course content. Any content that uses a previously uploaded video ID continues to display in the course.
cy: Nid yw dileu fideo o'r rhestr hon yn effeithio ar gynnwys y cwrs. Bydd unrhyw gynnwys sy'n defnyddio rhif adnabod fideo a lwythwyd i fyny eisoes yn parhau i'w weld yn y cwrs.

source: Your changes will not take effect until you save your progress. Take care with key and value formatting, as validation is not implemented.
cy: Ni fydd eich newidiadau'n weithredol nes i chi gadw eich cynnydd. Cymerwch ofal wrth fformatio allweddi a gwerthu, am na chaiff ei wirio.

source: Your policy changes have been saved.
cy: Mae'r newidiadau polisi wedi cael eu cadw.

source: No validation is performed on policy keys or value pairs. If you are having difficulties, check your formatting.
cy: Ni pherfformir dilysiad ar allweddi polisi na pharau gwerth. Os ydych yn cael anhawster, gwiriwch eich fformatio.

source: For grading to work, you must change all {oldName} subsections to {newName}.
cy: Ar gyfer gwaith graddio, rhaid i newid pob is-adran {oldName} i {newName}.

source: Course Credit Requirements
cy: Gofynion credydau cwrs

source: The minimum grade for course credit is not set.
cy: Nid yw'r radd ofynnol ar gyfer credyd cwrs wedi'i gosod.
